jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2011 Realtek Corporation. All rights reserved.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 * You should have received a copy of the GNU General Public License along with
 * this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110, USA
 *
 *
 ******************************************************************************/
#define _OS_INTFS_C_

#include <drv_types.h>
#include <hal_data.h>

#if defined (PLATFORM_LINUX) && defined (PLATFORM_WINDOWS)

#error "Shall be Linux or Windows, but not both!\n"

#endif


MODULE_LICENSE ("GPL");
MODULE_DESCRIPTION ("Realtek Wireless Lan Driver");
MODULE_AUTHOR ("Realtek Semiconductor Corp.");
MODULE_VERSION (DRIVERVERSION);

/* module param defaults */
int rtw_chip_version = 0x00;
int rtw_rfintfs = HWPI;
int rtw_lbkmode = 0;//RTL8712_AIR_TRX;


int rtw_network_mode = Ndis802_11IBSS;//Ndis802_11Infrastructure;//infra, ad-hoc, auto
int rtw_channel = 1;//ad-hoc support requirement
int rtw_wireless_mode = WIRELESS_MODE_MAX;
int rtw_vrtl_carrier_sense = AUTO_VCS;
int rtw_vcs_type = RTS_CTS;//*
int rtw_rts_thresh = 2347;//*
int rtw_frag_thresh = 2346;//*
int rtw_preamble = PREAMBLE_LONG;//long, short, auto
int rtw_scan_mode = 1;//active, passive
int rtw_adhoc_tx_pwr = 1;
int rtw_soft_ap = 0;
#ifdef CONFIG_POWER_SAVING
int rtw_power_mgnt = 1;
#ifdef CONFIG_IPS_LEVEL_2
int rtw_ips_mode = IPS_LEVEL_2;
#else
int rtw_ips_mode = IPS_NORMAL;
#endif
#else
int rtw_power_mgnt = PS_MODE_ACTIVE;
int rtw_ips_mode = IPS_NONE;
#endif
module_param (rtw_ips_mode, int, 0644);
MODULE_PARM_DESC (rtw_ips_mode, "The default IPS mode");

int rtw_smart_ps = 2;

int rtw_check_fw_ps = 1;

#ifdef CONFIG_TX_EARLY_MODE
int rtw_early_mode = 1;
#endif

int rtw_usb_rxagg_mode = 2;//USB_RX_AGG_DMA =1,USB_RX_AGG_USB=2
module_param (rtw_usb_rxagg_mode, int, 0644);

int rtw_radio_enable = 1;
int rtw_long_retry_lmt = 7;
int rtw_short_retry_lmt = 7;
int rtw_busy_thresh = 40;
int rtw_ack_policy = NORMAL_ACK;

int rtw_mp_mode = 0;

int rtw_software_encrypt = 0;
int rtw_software_decrypt = 0;

int rtw_acm_method = 0;// 0:By SW 1:By HW.

int rtw_wmm_enable = 1;// default is set to enable the wmm.
int rtw_uapsd_enable = 0;
int rtw_uapsd_max_sp = NO_LIMIT;
int rtw_uapsd_acbk_en = 0;
int rtw_uapsd_acbe_en = 0;
int rtw_uapsd_acvi_en = 0;
int rtw_uapsd_acvo_en = 0;

#ifdef CONFIG_80211N_HT
int rtw_ht_enable = 1;
int rtw_bw_mode = 0x21;
int rtw_cbw40_enable = 3;
int rtw_ampdu_enable = 1;//for enable tx_ampdu
int rtw_rx_stbc = 1;// 0: disable, bit(0):enable 2.4g, bit(1):enable 5g, default is set to enable 2.4GHZ for IOT issue with bufflao's AP at 5GHZ
int rtw_ampdu_amsdu = 0;// 0: disabled, 1:enabled, 2:auto
int rtw_short_gi = 0xf;
int rtw_ldpc_cap = 0x33;
int rtw_stbc_cap = 0x13;
int rtw_beamform_cap = 0x2;
#endif

#ifdef CONFIG_80211AC_VHT
int rtw_vht_enable = 1;
int rtw_ampdu_factor = 7;
int rtw_vht_rate_sel = 0;
#endif

int rtw_lowrate_two_xmit = 1;//Use 2 path Tx to transmit MCS0~7 and legacy mode

int rtw_rf_config = RF_MAX_TYPE; 
int rtw_low_power = 0;
#ifdef CONFIG_WIFI_TEST
int rtw_wifi_spec = 1;//for wifi test
#else
int rtw_wifi_spec = 0;
#endif
int rtw_channel_plan = RT_CHANNEL_DOMAIN_MAX;

#ifdef CONFIG_BT_COEXIST
int rtw_btcoex_enable = 1;
module_param (rtw_btcoex_enable, int, 0644);
MODULE_PARM_DESC (rtw_btcoex_enable, "Enable BT co-existence mechanism");
int rtw_bt_iso = 2;// 0:Low, 1:High, 2:From Efuse
int rtw_bt_sco = 3;// 0:Idle, 1:None-SCO, 2:SCO, 3:From Counter, 4.Busy, 5.OtherBusy
int rtw_bt_ampdu = 1 ;
int rtw_ant_num = -1;
module_param (rtw_ant_num, int, 0644);
MODULE_PARM_DESC (rtw_ant_num, "Antenna number setting");
#endif

int rtw_AcceptAddbaReq = _TRUE;// 0:Reject AP's Add BA req, 1:Accept AP's Add BA req.

int rtw_antdiv_cfg = 2;
int rtw_antdiv_type = 0 ;


#ifdef CONFIG_USB_AUTOSUSPEND
int rtw_enusbss = 1;//0:disable,1:enable
#else
int rtw_enusbss = 0;//0:disable,1:enable
#endif

int rtw_hwpdn_mode = 2;

#ifdef CONFIG_HW_PWRP_DETECTION
int rtw_hwpwrp_detect = 1;
#else
int rtw_hwpwrp_detect = 0;
#endif

#ifdef CONFIG_USB_HCI
int rtw_hw_wps_pbc = 1;
#else
int rtw_hw_wps_pbc = 0;
#endif

#ifdef CONFIG_TX_MCAST2UNI
int rtw_mc2u_disable = 0;
#endif 

#ifdef CONFIG_DUALMAC_CONCURRENT
int rtw_dmsp = 0;
#endif 

#ifdef CONFIG_80211D
int rtw_80211d = 0;
#endif

#ifdef CONFIG_SPECIAL_SETTING_FOR_FUNAI_TV
int rtw_force_ant = 2;//0 :normal, 1:Main ant, 2:Aux ant
int rtw_force_igi = 0;
module_param (rtw_force_ant, int, 0644);
module_param (rtw_force_igi, int, 0644);
#endif

#ifdef CONFIG_QOS_OPTIMIZATION
int rtw_qos_opt_enable = 1;
#else
int rtw_qos_opt_enable = 0;
#endif
module_param (rtw_qos_opt_enable, int, 0644);

char * ifname = "wlan%d";
module_param (ifname, charp, 0644);
MODULE_PARM_DESC (ifname, "The default name to allocate for first interface");

char * if2name = "wlan%d";
module_param (if2name, charp, 0644);
MODULE_PARM_DESC (if2name, "The default name to allocate for second interface");

char * rtw_initmac = 0;

#ifdef CONFIG_MULTI_VIR_IFACES
int rtw_ext_iface_num  = 1;//primary/secondary iface is excluded
module_param (rtw_ext_iface_num, int, 0644);
#endif

module_param (rtw_initmac, charp, 0644);
module_param (rtw_channel_plan, int, 0644);
module_param (rtw_chip_version, int, 0644);
module_param (rtw_rfintfs, int, 0644);
module_param (rtw_lbkmode, int, 0644);
module_param (rtw_network_mode, int, 0644);
module_param (rtw_channel, int, 0644);
module_param (rtw_mp_mode, int, 0644);
module_param (rtw_wmm_enable, int, 0644);
module_param (rtw_vrtl_carrier_sense, int, 0644);
module_param (rtw_vcs_type, int, 0644);
module_param (rtw_busy_thresh, int, 0644);

#ifdef CONFIG_80211N_HT
module_param (rtw_ht_enable, int, 0644);
module_param (rtw_bw_mode, int, 0644);
module_param (rtw_ampdu_enable, int, 0644);
module_param (rtw_rx_stbc, int, 0644);
module_param (rtw_ampdu_amsdu, int, 0644);
#endif
#ifdef CONFIG_80211AC_VHT
module_param (rtw_vht_enable, int, 0644);
#endif

module_param (rtw_lowrate_two_xmit, int, 0644);

module_param (rtw_rf_config, int, 0644);
module_param (rtw_power_mgnt, int, 0644);
module_param (rtw_smart_ps, int, 0644);
module_param (rtw_low_power, int, 0644);
module_param (rtw_wifi_spec, int, 0644);

