jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
module_param (rtw_antdiv_cfg, int, 0644);
module_param (rtw_antdiv_type, int, 0644);

module_param (rtw_enusbss, int, 0644);
module_param (rtw_hwpdn_mode, int, 0644);
module_param (rtw_hwpwrp_detect, int, 0644);

module_param (rtw_hw_wps_pbc, int, 0644);

#ifdef CONFIG_TX_EARLY_MODE
module_param (rtw_early_mode, int, 0644);
#endif
#ifdef CONFIG_ADAPTOR_INFO_CACHING_FILE
char * rtw_adaptor_info_caching_file_path = "/data/misc/wifi/rtw_cache";
module_param (rtw_adaptor_info_caching_file_path, charp, 0644);
MODULE_PARM_DESC (rtw_adaptor_info_caching_file_path, "The path of adapter info cache file");
#endif

#ifdef CONFIG_LAYER2_ROAMING
uint rtw_max_roaming_times = 2;
module_param (rtw_max_roaming_times, uint, 0644);
MODULE_PARM_DESC (rtw_max_roaming_times, "The max roaming times to try");
#endif

#ifdef CONFIG_IOL
int rtw_fw_iol = 1;
module_param (rtw_fw_iol, int, 0644);
MODULE_PARM_DESC (rtw_fw_iol, "FW IOL");
#endif

#ifdef CONFIG_FILE_FWIMG
char * rtw_fw_file_path = "/system/etc/firmware/rtlwifi/FW_NIC.BIN";
module_param (rtw_fw_file_path, charp, 0644);
MODULE_PARM_DESC (rtw_fw_file_path, "The path of fw image");

char * rtw_fw_wow_file_path = "/system/etc/firmware/rtlwifi/FW_WoWLAN.BIN";
module_param (rtw_fw_wow_file_path, charp, 0644);
MODULE_PARM_DESC (rtw_fw_wow_file_path, "The path of fw for Wake on Wireless image");

#ifdef CONFIG_MP_INCLUDED
char * rtw_fw_mp_bt_file_path = "";
module_param (rtw_fw_mp_bt_file_path, charp, 0644);
MODULE_PARM_DESC (rtw_fw_mp_bt_file_path, "The path of fw for MP-BT image");
#endif
#endif

#ifdef CONFIG_TX_MCAST2UNI
module_param (rtw_mc2u_disable, int, 0644);
#endif 

#ifdef CONFIG_DUALMAC_CONCURRENT
module_param (rtw_dmsp, int, 0644);
#endif 

#ifdef CONFIG_80211D
module_param (rtw_80211d, int, 0644);
MODULE_PARM_DESC (rtw_80211d, "Enable 802.11d mechanism");
#endif

uint rtw_notch_filter = RTW_NOTCH_FILTER;
module_param (rtw_notch_filter, uint, 0644);
MODULE_PARM_DESC (rtw_notch_filter, "0:Disable, 1:Enable, 2:Enable only for P2P");

#if defined(CONFIG_CALIBRATE_TX_POWER_BY_REGULATORY)
int rtw_tx_pwr_lmt_enable = 1;
int rtw_tx_pwr_by_rate = 1;
#elif defined(CONFIG_CALIBRATE_TX_POWER_TO_MAX)//eFuse: Regulatory selection=0
int rtw_tx_pwr_lmt_enable = 0;
int rtw_tx_pwr_by_rate = 1;
#else
int rtw_tx_pwr_lmt_enable = 0;
int rtw_tx_pwr_by_rate = 0;
#endif

module_param (rtw_tx_pwr_lmt_enable, int, 0644);
MODULE_PARM_DESC (rtw_tx_pwr_lmt_enable, "0:Disable, 1:Enable, 2: Depend on efuse");

module_param (rtw_tx_pwr_by_rate, int, 0644);
MODULE_PARM_DESC (rtw_tx_pwr_by_rate, "0:Disable, 1:Enable, 2: Depend on efuse");

#ifdef CONFIG_LOAD_PHY_PARA_FROM_FILE
char * rtw_phy_file_path = "";
module_param (rtw_phy_file_path, charp, 0644);
MODULE_PARM_DESC (rtw_phy_file_path, "The path of phy parameter");
int rtw_load_phy_file = (BIT2 | BIT6);
module_param (rtw_load_phy_file, int, 0644);
MODULE_PARM_DESC (rtw_load_phy_file, "PHY File Bit Map");
int rtw_decrypt_phy_file = 0;
module_param (rtw_decrypt_phy_file, int, 0644);
MODULE_PARM_DESC (rtw_decrypt_phy_file, "Enable Decrypt PHY File");
#endif

static uint loadparam (PADAPTER padapter, _nic_hdl pnetdev);
int _netdev_open (struct net_device * pnetdev);
int netdev_open (struct net_device * pnetdev);
static int netdev_close (struct net_device * pnetdev);

uint loadparam ( _adapter * padapter,  _nic_hdl pnetdev)
{

  uint status = _SUCCESS;
  struct registry_priv * registry_par = &padapter->registrypriv;
  
  _func_enter_;
  
  registry_par->chip_version = (u8) rtw_chip_version;
  registry_par->rfintfs = (u8) rtw_rfintfs;
  registry_par->lbkmode = (u8) rtw_lbkmode;
  registry_par->network_mode  = (u8) rtw_network_mode;
  
  _rtw_memcpy (registry_par->ssid.Ssid, "ANY", 3);
  registry_par->ssid.SsidLength = 3;
  
  registry_par->channel = (u8) rtw_channel;
  registry_par->wireless_mode = (u8) rtw_wireless_mode;
  
  if (IsSupported24G (registry_par->wireless_mode) && (!IsSupported5G (registry_par->wireless_mode) )
      && (registry_par->channel > 14) ) {
    registry_par->channel = 1;
  }
  else
    if (IsSupported5G (registry_par->wireless_mode) && (!IsSupported24G (registry_par->wireless_mode) )
        && (registry_par->channel <= 14) ) {
      registry_par->channel = 36;
    }
    
  registry_par->vrtl_carrier_sense = (u8) rtw_vrtl_carrier_sense ;
  registry_par->vcs_type = (u8) rtw_vcs_type;
  registry_par->rts_thresh = (u16) rtw_rts_thresh;
  registry_par->frag_thresh = (u16) rtw_frag_thresh;
  registry_par->preamble = (u8) rtw_preamble;
  registry_par->scan_mode = (u8) rtw_scan_mode;
  registry_par->adhoc_tx_pwr = (u8) rtw_adhoc_tx_pwr;
  registry_par->soft_ap =  (u8) rtw_soft_ap;
  registry_par->smart_ps =  (u8) rtw_smart_ps;
  registry_par->check_fw_ps = (u8) rtw_check_fw_ps;
  registry_par->power_mgnt = (u8) rtw_power_mgnt;
  registry_par->ips_mode = (u8) rtw_ips_mode;
  registry_par->radio_enable = (u8) rtw_radio_enable;
  registry_par->long_retry_lmt = (u8) rtw_long_retry_lmt;
  registry_par->short_retry_lmt = (u8) rtw_short_retry_lmt;
  registry_par->busy_thresh = (u16) rtw_busy_thresh;
  registry_par->ack_policy = (u8) rtw_ack_policy;
  registry_par->mp_mode = (u8) rtw_mp_mode;
  registry_par->software_encrypt = (u8) rtw_software_encrypt;
  registry_par->software_decrypt = (u8) rtw_software_decrypt;
  
  registry_par->acm_method = (u8) rtw_acm_method;
  registry_par->usb_rxagg_mode = (u8) rtw_usb_rxagg_mode;
  
  registry_par->wmm_enable = (u8) rtw_wmm_enable;
  registry_par->uapsd_enable = (u8) rtw_uapsd_enable;
  registry_par->uapsd_max_sp = (u8) rtw_uapsd_max_sp;
  registry_par->uapsd_acbk_en = (u8) rtw_uapsd_acbk_en;
  registry_par->uapsd_acbe_en = (u8) rtw_uapsd_acbe_en;
  registry_par->uapsd_acvi_en = (u8) rtw_uapsd_acvi_en;
  registry_par->uapsd_acvo_en = (u8) rtw_uapsd_acvo_en;
  
  #ifdef CONFIG_80211N_HT
  registry_par->ht_enable = (u8) rtw_ht_enable;
  registry_par->bw_mode = (u8) rtw_bw_mode;
  registry_par->ampdu_enable = (u8) rtw_ampdu_enable;
  registry_par->rx_stbc = (u8) rtw_rx_stbc;
  registry_par->ampdu_amsdu = (u8) rtw_ampdu_amsdu;
  registry_par->short_gi = (u8) rtw_short_gi;
  registry_par->ldpc_cap = (u8) rtw_ldpc_cap;
  registry_par->stbc_cap = (u8) rtw_stbc_cap;
  registry_par->beamform_cap = (u8) rtw_beamform_cap;
  #endif
  
