jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  #ifdef CONFIG_80211AC_VHT
  registry_par->vht_enable = (u8) rtw_vht_enable;
  registry_par->ampdu_factor = (u8) rtw_ampdu_factor;
  registry_par->vht_rate_sel = (u8) rtw_vht_rate_sel;
  #endif
  
  #ifdef CONFIG_TX_EARLY_MODE
  registry_par->early_mode = (u8) rtw_early_mode;
  #endif
  registry_par->lowrate_two_xmit = (u8) rtw_lowrate_two_xmit;
  registry_par->rf_config = (u8) rtw_rf_config;
  registry_par->low_power = (u8) rtw_low_power;
  
  
  registry_par->wifi_spec = (u8) rtw_wifi_spec;
  
  registry_par->channel_plan = (u8) rtw_channel_plan;
  
  #ifdef CONFIG_BT_COEXIST
  registry_par->btcoex = (u8) rtw_btcoex_enable;
  registry_par->bt_iso = (u8) rtw_bt_iso;
  registry_par->bt_sco = (u8) rtw_bt_sco;
  registry_par->bt_ampdu = (u8) rtw_bt_ampdu;
  registry_par->ant_num = (s8) rtw_ant_num;
  #endif
  
  registry_par->bAcceptAddbaReq = (u8) rtw_AcceptAddbaReq;
  
  registry_par->antdiv_cfg = (u8) rtw_antdiv_cfg;
  registry_par->antdiv_type = (u8) rtw_antdiv_type;
  
  #ifdef CONFIG_AUTOSUSPEND
  registry_par->usbss_enable = (u8) rtw_enusbss;
  #endif
  #ifdef SUPPORT_HW_RFOFF_DETECTED
  registry_par->hwpdn_mode = (u8) rtw_hwpdn_mode;
  registry_par->hwpwrp_detect = (u8) rtw_hwpwrp_detect;
  #endif
  
  registry_par->hw_wps_pbc = (u8) rtw_hw_wps_pbc;
  
  #ifdef CONFIG_ADAPTOR_INFO_CACHING_FILE
  snprintf (registry_par->adaptor_info_caching_file_path, PATH_LENGTH_MAX, "%s", rtw_adaptor_info_caching_file_path);
  registry_par->adaptor_info_caching_file_path[PATH_LENGTH_MAX - 1] = 0;
  #endif
  
  #ifdef CONFIG_LAYER2_ROAMING
  registry_par->max_roaming_times = (u8) rtw_max_roaming_times;
  #ifdef CONFIG_INTEL_WIDI
  registry_par->max_roaming_times = (u8) rtw_max_roaming_times + 2;
  #endif
  #endif
  
  #ifdef CONFIG_IOL
  registry_par->fw_iol = rtw_fw_iol;
  #endif
  
  #ifdef CONFIG_DUALMAC_CONCURRENT
  registry_par->dmsp = (u8) rtw_dmsp;
  #endif
  
  #ifdef CONFIG_80211D
  registry_par->enable80211d = (u8) rtw_80211d;
  #endif
  
  snprintf (registry_par->ifname, 16, "%s", ifname);
  snprintf (registry_par->if2name, 16, "%s", if2name);
  
  registry_par->notch_filter = (u8) rtw_notch_filter;
  
  #ifdef CONFIG_SPECIAL_SETTING_FOR_FUNAI_TV
  registry_par->force_ant = (u8) rtw_force_ant;
  registry_par->force_igi = (u8) rtw_force_igi;
  #endif
  
  #ifdef CONFIG_MULTI_VIR_IFACES
  registry_par->ext_iface_num = (u8) rtw_ext_iface_num;
  #endif
  
  registry_par->RegEnableTxPowerLimit = (u8) rtw_tx_pwr_lmt_enable;
  registry_par->RegEnableTxPowerByRate = (u8) rtw_tx_pwr_by_rate;
  
  registry_par->RegPowerBase = 14;
  registry_par->TxBBSwing_2G = 0xFF;
  registry_par->TxBBSwing_5G = 0xFF;
  registry_par->bEn_RFE = 1;
  registry_par->RFE_Type = 64;
  
  #ifdef CONFIG_LOAD_PHY_PARA_FROM_FILE
  registry_par->load_phy_file = (u8) rtw_load_phy_file;
  registry_par->RegDecryptCustomFile = (u8) rtw_decrypt_phy_file;
  #endif
  registry_par->qos_opt_enable = (u8) rtw_qos_opt_enable;
  
  _func_exit_;
  
  return status;
}

static int rtw_net_set_mac_address (struct net_device * pnetdev, void * p)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  struct sockaddr * addr = p;
  
  if (padapter->bup == _FALSE)
  {
    _rtw_memcpy (padapter->eeprompriv.mac_addr, addr->sa_data, ETH_ALEN);
  }
  
  return 0;
}

static struct net_device_stats * rtw_net_get_stats (struct net_device * pnetdev)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  struct xmit_priv * pxmitpriv = & (padapter->xmitpriv);
  struct recv_priv * precvpriv = & (padapter->recvpriv);
  
  padapter->stats.tx_packets = pxmitpriv->tx_pkts;//pxmitpriv->tx_pkts++;
  padapter->stats.rx_packets = precvpriv->rx_pkts;//precvpriv->rx_pkts++;
  padapter->stats.tx_dropped = pxmitpriv->tx_drop;
  padapter->stats.rx_dropped = precvpriv->rx_drop;
  padapter->stats.tx_bytes = pxmitpriv->tx_bytes;
  padapter->stats.rx_bytes = precvpriv->rx_bytes;
  
  return &padapter->stats;
}

#if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,35))
/*
 * AC to queue mapping
 *
 * AC_VO -> queue 0
 * AC_VI -> queue 1
 * AC_BE -> queue 2
 * AC_BK -> queue 3
 */
static const u16 rtw_1d_to_queue[8] = { 2, 3, 3, 2, 1, 1, 0, 0 };

/* Given a data frame determine the 802.1p/1d tag to use. */
unsigned int rtw_classify8021d (struct sk_buff * skb)
{
  unsigned int dscp;
  
  /* skb->priority values from 256->263 are magic values to
   * directly indicate a specific 802.1d priority.  This is used
   * to allow 802.1d priority to be passed directly in from VLAN
   * tags, etc.
   */
  if (skb->priority >= 256 && skb->priority <= 263)
  { return skb->priority - 256; }
  
  switch (skb->protocol) {
  case htons (ETH_P_IP) :
    dscp = ip_hdr (skb)->tos & 0xfc;
    break;
  default:
    return 0;
  }
  
  return dscp >> 5;
}

static u16 rtw_select_queue (struct net_device * dev, struct sk_buff * skb)
{
  _adapter * padapter = rtw_netdev_priv (dev);
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  
  skb->priority = rtw_classify8021d (skb);
  
  if (pmlmepriv->acm_mask != 0)
  {
    skb->priority = qos_acm (pmlmepriv->acm_mask, skb->priority);
  }
  
  return rtw_1d_to_queue[skb->priority];
}

u16 rtw_recv_select_queue (struct sk_buff * skb)
{
  struct iphdr * piphdr;
  unsigned int dscp;
  u16 eth_type;
  u32 priority;
  u8 * pdata = skb->data;
  
  _rtw_memcpy (&eth_type, pdata + (ETH_ALEN << 1), 2);
  
  switch (eth_type) {
  case htons (ETH_P_IP) :
  
    piphdr = (struct iphdr *) (pdata + ETH_HLEN);
    
    dscp = piphdr->tos & 0xfc;
    
    priority = dscp >> 5;
    
    break;
  default:
    priority = 0;
  }
  
  return rtw_1d_to_queue[priority];
  
}

#endif

static int rtw_ndev_notifier_call (struct notifier_block * nb, unsigned long state, void * ndev)
{
  struct net_device * dev = ndev;
  
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
  if (dev->netdev_ops->ndo_do_ioctl != rtw_ioctl)
  #else
  if (dev->do_ioctl != rtw_ioctl)
  #endif
    return NOTIFY_DONE;
    
  DBG_871X_LEVEL (_drv_info_, FUNC_NDEV_FMT" state:%lu\n", FUNC_NDEV_ARG (dev), state);
  
  switch (state) {
  case NETDEV_CHANGENAME:
    rtw_adapter_proc_replace (dev);
    break;
  }
  
