jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  return NOTIFY_DONE;
}

static struct notifier_block rtw_ndev_notifier = {
  .notifier_call = rtw_ndev_notifier_call,
};

int rtw_ndev_notifier_register (void)
{
  return register_netdevice_notifier (&rtw_ndev_notifier);
}

void rtw_ndev_notifier_unregister (void)
{
  unregister_netdevice_notifier (&rtw_ndev_notifier);
}


int rtw_ndev_init (struct net_device * dev)
{
  _adapter * adapter = rtw_netdev_priv (dev);
  
  DBG_871X_LEVEL (_drv_always_, FUNC_ADPT_FMT"\n", FUNC_ADPT_ARG (adapter) );
  strncpy (adapter->old_ifname, dev->name, IFNAMSIZ);
  rtw_adapter_proc_init (dev);
  
  return 0;
}

void rtw_ndev_uninit (struct net_device * dev)
{
  _adapter * adapter = rtw_netdev_priv (dev);
  
  DBG_871X_LEVEL (_drv_always_, FUNC_ADPT_FMT"\n", FUNC_ADPT_ARG (adapter) );
  rtw_adapter_proc_deinit (dev);
}

#if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
static const struct net_device_ops rtw_netdev_ops = {
  .ndo_init = rtw_ndev_init,
  .ndo_uninit = rtw_ndev_uninit,
  .ndo_open = netdev_open,
  .ndo_stop = netdev_close,
  .ndo_start_xmit = rtw_xmit_entry,
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,35))
  .ndo_select_queue = rtw_select_queue,
  #endif
  .ndo_set_mac_address = rtw_net_set_mac_address,
  .ndo_get_stats = rtw_net_get_stats,
  .ndo_do_ioctl = rtw_ioctl,
};
#endif

int rtw_init_netdev_name (struct net_device * pnetdev, const char * ifname)
{
  _adapter * padapter = rtw_netdev_priv (pnetdev);
  
  #ifdef CONFIG_EASY_REPLACEMENT
  struct net_device * TargetNetdev = NULL;
  _adapter   *   TargetAdapter = NULL;
  struct net  *  devnet = NULL;
  
  if (padapter->bDongle == 1)
  {
    #if (LINUX_VERSION_CODE < KERNEL_VERSION(2,6,24))
    TargetNetdev = dev_get_by_name ("wlan0");
    #else
    #if (LINUX_VERSION_CODE < KERNEL_VERSION(2,6,26))
    devnet = pnetdev->nd_net;
    #else
    devnet = dev_net (pnetdev);
    #endif
    TargetNetdev = dev_get_by_name (devnet, "wlan0");
    #endif
    if (TargetNetdev) {
      DBG_871X ("Force onboard module driver disappear !!!\n");
      TargetAdapter = rtw_netdev_priv (TargetNetdev);
      TargetAdapter->DriverState = DRIVER_DISAPPEAR;
      
      padapter->pid[0] = TargetAdapter->pid[0];
      padapter->pid[1] = TargetAdapter->pid[1];
      padapter->pid[2] = TargetAdapter->pid[2];
      
      dev_put (TargetNetdev);
      unregister_netdev (TargetNetdev);
      
      padapter->DriverState = DRIVER_REPLACE_DONGLE;
    }
  }
  #endif
  
  if (dev_alloc_name (pnetdev, ifname) < 0)
  {
    RT_TRACE (_module_os_intfs_c_, _drv_err_, ("dev_alloc_name, fail! \n") );
  }
  
  netif_carrier_off (pnetdev);
  
  return 0;
}

struct net_device * rtw_init_netdev (_adapter * old_padapter)
{
  _adapter * padapter;
  struct net_device * pnetdev;
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+init_net_dev\n") );
  
  if (old_padapter != NULL)
  { pnetdev = rtw_alloc_etherdev_with_old_priv (sizeof (_adapter), (void *) old_padapter); }
  else
  { pnetdev = rtw_alloc_etherdev (sizeof (_adapter) ); }
  
  if (!pnetdev)
  { return NULL; }
  
  padapter = rtw_netdev_priv (pnetdev);
  padapter->pnetdev = pnetdev;
  
  #if LINUX_VERSION_CODE < KERNEL_VERSION(2,6,24)
  SET_MODULE_OWNER (pnetdev);
  #endif
  
  
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
  DBG_871X ("register rtw_netdev_ops to netdev_ops\n");
  pnetdev->netdev_ops = &rtw_netdev_ops;
  #else
  pnetdev->init = rtw_ndev_init;
  pnetdev->uninit = rtw_ndev_uninit;
  pnetdev->open = netdev_open;
  pnetdev->stop = netdev_close;
  pnetdev->hard_start_xmit = rtw_xmit_entry;
  pnetdev->set_mac_address = rtw_net_set_mac_address;
  pnetdev->get_stats = rtw_net_get_stats;
  pnetdev->do_ioctl = rtw_ioctl;
  #endif
  
  
  #ifdef CONFIG_TCP_CSUM_OFFLOAD_TX
  pnetdev->features |= NETIF_F_IP_CSUM;
  #endif
  pnetdev->watchdog_timeo = HZ * 3; /* 3 second timeout */
  #ifdef CONFIG_WIRELESS_EXT
  pnetdev->wireless_handlers = (struct iw_handler_def *) &rtw_handlers_def;
  #endif
  
  #ifdef WIRELESS_SPY
  #endif
  
  loadparam (padapter, pnetdev);
  
  return pnetdev;
  
}

void rtw_unregister_netdevs (struct dvobj_priv * dvobj)
{
  int i;
  _adapter * padapter = NULL;
  
  for (i = 0; i < dvobj->iface_nums; i++)
  {
    struct net_device * pnetdev = NULL;
    
    padapter = dvobj->padapters[i];
    
    if (padapter == NULL)
    { continue; }
    
    pnetdev = padapter->pnetdev;
    
    if ( (padapter->DriverState != DRIVER_DISAPPEAR) && pnetdev) {
    
      unregister_netdev (pnetdev);
    }
    
    #ifdef CONFIG_IOCTL_CFG80211
    rtw_wdev_unregister (padapter->rtw_wdev);
    #endif
    
  }
  
}

u32 rtw_start_drv_threads (_adapter * padapter)
{
  u32 _status = _SUCCESS;
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+rtw_start_drv_threads\n") );
  #ifdef CONFIG_XMIT_THREAD_MODE
  #if defined(CONFIG_SDIO_HCI) && defined(CONFIG_CONCURRENT_MODE)
  if (padapter->adapter_type == PRIMARY_ADAPTER) {
  #endif
    padapter->xmitThread = kthread_run (rtw_xmit_thread, padapter, "RTW_XMIT_THREAD");
    if (IS_ERR (padapter->xmitThread) )
    { _status = _FAIL; }
    #if defined(CONFIG_SDIO_HCI) && defined(CONFIG_CONCURRENT_MODE)
  }
    #endif   
  #endif
  
  #ifdef CONFIG_RECV_THREAD_MODE
  padapter->recvThread = kthread_run (rtw_recv_thread, padapter, "RTW_RECV_THREAD");
  if (IS_ERR (padapter->recvThread) )
  { _status = _FAIL; }
  #endif
  
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (padapter->isprimary == _TRUE)
  #endif
  {
    padapter->cmdThread = kthread_run (rtw_cmd_thread, padapter, "RTW_CMD_THREAD");
    if (IS_ERR (padapter->cmdThread) )
    { _status = _FAIL; }
    else
    { _rtw_down_sema (&padapter->cmdpriv.terminate_cmdthread_sema); }
  }
  
  
  #ifdef CONFIG_EVENT_THREAD_MODE
  padapter->evtThread = kthread_run (event_thread, padapter, "RTW_EVENT_THREAD");
  if (IS_ERR (padapter->evtThread) )
  { _status = _FAIL; }
  #endif
  
  rtw_hal_start_thread (padapter);
  return _status;
  
}

void rtw_stop_drv_threads (_adapter * padapter)
{
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+rtw_stop_drv_threads\n") );
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (padapter->isprimary == _TRUE)
  #endif
  {
    rtw_stop_cmd_thread (padapter);
  }
  
  #ifdef CONFIG_EVENT_THREAD_MODE
  _rtw_up_sema (&padapter->evtpriv.evt_notify);
  if (padapter->evtThread) {
    _rtw_down_sema (&padapter->evtpriv.terminate_evtthread_sema);
  }
  #endif
  
