jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  #ifdef CONFIG_XMIT_THREAD_MODE
  #if defined(CONFIG_SDIO_HCI) && defined(CONFIG_CONCURRENT_MODE)
  if (padapter->adapter_type == PRIMARY_ADAPTER)
  #endif 
  {
    _rtw_up_sema (&padapter->xmitpriv.xmit_sema);
    _rtw_down_sema (&padapter->xmitpriv.terminate_xmitthread_sema);
  }
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("\n drv_halt: rtw_xmit_thread can be terminated ! \n") );
  #endif
  
  #ifdef CONFIG_RECV_THREAD_MODE
  _rtw_up_sema (&padapter->recvpriv.recv_sema);
  _rtw_down_sema (&padapter->recvpriv.terminate_recvthread_sema);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("\n drv_halt:recv_thread can be terminated! \n") );
  #endif
  
  rtw_hal_stop_thread (padapter);
}

u8 rtw_init_default_value (_adapter * padapter);
u8 rtw_init_default_value (_adapter * padapter)
{
  u8 ret  = _SUCCESS;
  struct registry_priv * pregistrypriv = &padapter->registrypriv;
  struct xmit_priv * pxmitpriv = &padapter->xmitpriv;
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct security_priv * psecuritypriv = &padapter->securitypriv;
  
  pxmitpriv->vcs_setting = pregistrypriv->vrtl_carrier_sense;
  pxmitpriv->vcs = pregistrypriv->vcs_type;
  pxmitpriv->vcs_type = pregistrypriv->vcs_type;
  pxmitpriv->frag_len = pregistrypriv->frag_thresh;
  
  
  pmlmepriv->scan_mode = SCAN_ACTIVE;
  
  
  #ifdef CONFIG_80211N_HT
  pmlmepriv->htpriv.ampdu_enable = _FALSE;//set to disabled
  #endif
  
  psecuritypriv->binstallGrpkey = _FAIL;
  #ifdef CONFIG_GTK_OL
  psecuritypriv->binstallKCK_KEK = _FAIL;
  #endif
  psecuritypriv->sw_encrypt = pregistrypriv->software_encrypt;
  psecuritypriv->sw_decrypt = pregistrypriv->software_decrypt;
  
  psecuritypriv->dot11AuthAlgrthm = dot11AuthAlgrthm_Open;
  psecuritypriv->dot11PrivacyAlgrthm = _NO_PRIVACY_;
  
  psecuritypriv->dot11PrivacyKeyIndex = 0;
  
  psecuritypriv->dot118021XGrpPrivacy = _NO_PRIVACY_;
  psecuritypriv->dot118021XGrpKeyid = 1;
  
  psecuritypriv->ndisauthtype = Ndis802_11AuthModeOpen;
  psecuritypriv->ndisencryptstatus = Ndis802_11WEPDisabled;
  
  
  
  
  rtw_init_registrypriv_dev_network (padapter);
  rtw_update_registrypriv_dev_network (padapter);
  
  
  rtw_hal_def_value_init (padapter);
  
  RTW_ENABLE_FUNC (padapter, DF_RX_BIT);
  RTW_ENABLE_FUNC (padapter, DF_TX_BIT);
  padapter->bLinkInfoDump = 0;
  padapter->bNotifyChannelChange = 0;
  #ifdef CONFIG_P2P
  padapter->bShowGetP2PState = 1;
  #endif
  
  padapter->fix_rate = 0xFF;
  
  return ret;
}

struct dvobj_priv * devobj_init (void)
{
  struct dvobj_priv * pdvobj = NULL;
  
  if ( (pdvobj = (struct dvobj_priv *) rtw_zmalloc (sizeof (*pdvobj) ) ) == NULL)
  {
    return NULL;
  }
  
  _rtw_mutex_init (&pdvobj->hw_init_mutex);
  _rtw_mutex_init (&pdvobj->h2c_fwcmd_mutex);
  _rtw_mutex_init (&pdvobj->setch_mutex);
  _rtw_mutex_init (&pdvobj->setbw_mutex);
  
  _rtw_spinlock_init (&pdvobj->lock);
  
  pdvobj->macid[1] = _TRUE;
  
  pdvobj->processing_dev_remove = _FALSE;
  
  ATOMIC_SET (&pdvobj->disable_func, 0);
  
  return pdvobj;
  
}

void devobj_deinit (struct dvobj_priv * pdvobj)
{
  if (!pdvobj)
  { return; }
  
  _rtw_spinlock_free (&pdvobj->lock);
  
  _rtw_mutex_free (&pdvobj->hw_init_mutex);
  _rtw_mutex_free (&pdvobj->h2c_fwcmd_mutex);
  _rtw_mutex_free (&pdvobj->setch_mutex);
  _rtw_mutex_free (&pdvobj->setbw_mutex);
  
  rtw_mfree ( (u8 *) pdvobj, sizeof (*pdvobj) );
}

u8 rtw_reset_drv_sw (_adapter * padapter)
{
  u8  ret8 = _SUCCESS;
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct pwrctrl_priv * pwrctrlpriv = adapter_to_pwrctl (padapter);
  
  if ( is_primary_adapter (padapter) )
  { rtw_hal_def_value_init (padapter); }
  
  RTW_ENABLE_FUNC (padapter, DF_RX_BIT);
  RTW_ENABLE_FUNC (padapter, DF_TX_BIT);
  padapter->bLinkInfoDump = 0;
  
  padapter->xmitpriv.tx_pkts = 0;
  padapter->recvpriv.rx_pkts = 0;
  
  pmlmepriv->LinkDetectInfo.bBusyTraffic = _FALSE;
  
  pmlmepriv->LinkDetectInfo.TrafficTransitionCount = 0;
  pmlmepriv->LinkDetectInfo.LowPowerTransitionCount = 0;
  
  _clr_fwstate_ (pmlmepriv, _FW_UNDER_SURVEY | _FW_UNDER_LINKING);
  
  #ifdef CONFIG_AUTOSUSPEND
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,22) && LINUX_VERSION_CODE<=KERNEL_VERSION(2,6,34))
  adapter_to_dvobj (padapter)->pusbdev->autosuspend_disabled = 1;
  #endif
  #endif
  
  #ifdef DBG_CONFIG_ERROR_DETECT
  if (is_primary_adapter (padapter) )
  { rtw_hal_sreset_reset_value (padapter); }
  #endif
  pwrctrlpriv->pwr_state_check_cnts = 0;
  
  padapter->mlmeextpriv.sitesurvey_res.state = SCAN_DISABLE;
  
  #ifdef CONFIG_NEW_SIGNAL_STAT_PROCESS
  rtw_set_signal_stat_timer (&padapter->recvpriv);
  #endif
  
  return ret8;
}


u8 rtw_init_drv_sw (_adapter * padapter)
{

  u8  ret8 = _SUCCESS;
  
  _func_enter_;
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+rtw_init_drv_sw\n") );
  
  ret8 = rtw_init_default_value (padapter);
  
  rtw_init_hal_com_default_value (padapter);
  
  if ( (rtw_init_cmd_priv (&padapter->cmdpriv) ) == _FAIL)
  {
    RT_TRACE (_module_os_intfs_c_, _drv_err_, ("\n Can't init cmd_priv\n") );
    ret8 = _FAIL;
    goto exit;
  }
  
  padapter->cmdpriv.padapter = padapter;
  
  if ( (rtw_init_evt_priv (&padapter->evtpriv) ) == _FAIL)
  {
    RT_TRACE (_module_os_intfs_c_, _drv_err_, ("\n Can't init evt_priv\n") );
    ret8 = _FAIL;
    goto exit;
  }
  
  
  if (rtw_init_mlme_priv (padapter) == _FAIL)
  {
    RT_TRACE (_module_os_intfs_c_, _drv_err_, ("\n Can't init mlme_priv\n") );
    ret8 = _FAIL;
    goto exit;
  }
  
  #ifdef CONFIG_P2P
  rtw_init_wifidirect_timers (padapter);
  init_wifidirect_info (padapter, P2P_ROLE_DISABLE);
  reset_global_wifidirect_info (padapter);
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_init_cfg80211_wifidirect_info (padapter);
  #endif
  #ifdef CONFIG_WFD
  if (rtw_init_wifi_display_info (padapter) == _FAIL)
  { RT_TRACE (_module_os_intfs_c_, _drv_err_, ("\n Can't init init_wifi_display_info\n") ); }
  #endif
  #endif /* CONFIG_P2P */
  
  if (init_mlme_ext_priv (padapter) == _FAIL)
  {
    RT_TRACE (_module_os_intfs_c_, _drv_err_, ("\n Can't init mlme_ext_priv\n") );
    ret8 = _FAIL;
    goto exit;
  }
  
  #ifdef CONFIG_TDLS
  if (rtw_init_tdls_info (padapter) == _FAIL)
  {
    DBG_871X ("Can't rtw_init_tdls_info\n");
    ret8 = _FAIL;
    goto exit;
  }
  #endif
  
  if (_rtw_init_xmit_priv (&padapter->xmitpriv, padapter) == _FAIL)
  {
    DBG_871X ("Can't _rtw_init_xmit_priv\n");
    ret8 = _FAIL;
    goto exit;
  }
  
  if (_rtw_init_recv_priv (&padapter->recvpriv, padapter) == _FAIL)
  {
    DBG_871X ("Can't _rtw_init_recv_priv\n");
    ret8 = _FAIL;
    goto exit;
  }
  _rtw_spinlock_init (&padapter->security_key_mutex);
  
  
  
  if (_rtw_init_sta_priv (&padapter->stapriv) == _FAIL)
  {
    DBG_871X ("Can't _rtw_init_sta_priv\n");
    ret8 = _FAIL;
    goto exit;
  }
  
  padapter->stapriv.padapter = padapter;
  padapter->setband = GHZ24_50;
  padapter->fix_rate = 0xFF;
  rtw_init_bcmc_stainfo (padapter);
  
  rtw_init_pwrctrl_priv (padapter);
  
  
