jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  #ifdef CONFIG_MP_INCLUDED
  if (init_mp_priv (padapter) == _FAIL) {
    DBG_871X ("%s: initialize MP private data Fail!\n", __func__);
  }
  #endif
  
  rtw_hal_dm_init (padapter);
  rtw_hal_sw_led_init (padapter);
  
  #ifdef DBG_CONFIG_ERROR_DETECT
  rtw_hal_sreset_init (padapter);
  #endif
  
  #ifdef CONFIG_INTEL_WIDI
  if (rtw_init_intel_widi (padapter) == _FAIL)
  {
    DBG_871X ("Can't rtw_init_intel_widi\n");
    ret8 = _FAIL;
    goto exit;
  }
  #endif
  
  #ifdef CONFIG_WAPI_SUPPORT
  padapter->WapiSupport = true;
  rtw_wapi_init (padapter);
  #endif
  
  #ifdef CONFIG_BR_EXT
  _rtw_spinlock_init (&padapter->br_ext_lock);
  #endif 
  
exit:

  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("-rtw_init_drv_sw\n") );
  
  _func_exit_;
  
  return ret8;
  
}

#ifdef CONFIG_WOWLAN
void rtw_cancel_dynamic_chk_timer (_adapter * padapter)
{
  _cancel_timer_ex (&padapter->mlmepriv.dynamic_chk_timer);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("rtw_cancel_all_timer:cancel dynamic_chk_timer! \n") );
}
#endif

void rtw_cancel_all_timer (_adapter * padapter)
{
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+rtw_cancel_all_timer\n") );
  
  _cancel_timer_ex (&padapter->mlmepriv.assoc_timer);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("rtw_cancel_all_timer:cancel association timer complete! \n") );
  
  
  _cancel_timer_ex (&padapter->mlmepriv.scan_to_timer);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("rtw_cancel_all_timer:cancel scan_to_timer! \n") );
  
  _cancel_timer_ex (&padapter->mlmepriv.dynamic_chk_timer);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("rtw_cancel_all_timer:cancel dynamic_chk_timer! \n") );
  
  rtw_hal_sw_led_deinit (padapter);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("rtw_cancel_all_timer:cancel DeInitSwLeds! \n") );
  
  _cancel_timer_ex (& (adapter_to_pwrctl (padapter)->pwr_state_check_timer) );
  
  #ifdef CONFIG_IOCTL_CFG80211
  #ifdef CONFIG_P2P
  _cancel_timer_ex (&padapter->cfg80211_wdinfo.remain_on_ch_timer);
  #endif
  #endif
  
  #ifdef CONFIG_SET_SCAN_DENY_TIMER
  _cancel_timer_ex (&padapter->mlmepriv.set_scan_deny_timer);
  rtw_clear_scan_deny (padapter);
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("rtw_cancel_all_timer:cancel set_scan_deny_timer! \n") );
  #endif
  
  #ifdef CONFIG_NEW_SIGNAL_STAT_PROCESS
  _cancel_timer_ex (&padapter->recvpriv.signal_stat_timer);
  #endif
  rtw_hal_dm_deinit (padapter);
  
  #ifdef CONFIG_PLATFORM_FS_MX61
  msleep (50);
  #endif
}

u8 rtw_free_drv_sw (_adapter * padapter)
{
  struct net_device * pnetdev = (struct net_device *) padapter->pnetdev;
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("==>rtw_free_drv_sw") );
  
  #ifdef CONFIG_WAPI_SUPPORT
  rtw_wapi_free (padapter);
  #endif
  
  #ifdef CONFIG_P2P
  {
    struct wifidirect_info * pwdinfo = &padapter->wdinfo;
    if (!rtw_p2p_chk_state (pwdinfo, P2P_STATE_NONE) )
    {
      _cancel_timer_ex ( &pwdinfo->find_phase_timer );
      _cancel_timer_ex ( &pwdinfo->restore_p2p_state_timer );
      _cancel_timer_ex ( &pwdinfo->pre_tx_scan_timer);
      #ifdef CONFIG_CONCURRENT_MODE
      _cancel_timer_ex ( &pwdinfo->ap_p2p_switch_timer );
      #endif
      rtw_p2p_set_state (pwdinfo, P2P_STATE_NONE);
    }
  }
  #endif
  _rtw_spinlock_free (&padapter->security_key_mutex);
  
  #ifdef CONFIG_BR_EXT
  _rtw_spinlock_free (&padapter->br_ext_lock);
  #endif 
  
  #ifdef CONFIG_INTEL_WIDI
  rtw_free_intel_widi (padapter);
  #endif
  
  free_mlme_ext_priv (&padapter->mlmeextpriv);
  
  #ifdef CONFIG_TDLS
  #endif
  
  rtw_free_cmd_priv (&padapter->cmdpriv);
  
  rtw_free_evt_priv (&padapter->evtpriv);
  
  rtw_free_mlme_priv (&padapter->mlmepriv);
  
  
  _rtw_free_xmit_priv (&padapter->xmitpriv);
  
  _rtw_free_sta_priv (&padapter->stapriv);
  
  _rtw_free_recv_priv (&padapter->recvpriv);
  
  rtw_free_pwrctrl_priv (padapter);
  
  
  #ifdef CONFIG_DRVEXT_MODULE
  free_drvext (&padapter->drvextpriv);
  #endif
  
  rtw_hal_free_data (padapter);
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("<==rtw_free_drv_sw\n") );
  
  if (padapter->rereg_nd_name_priv.old_pnetdev) {
    free_netdev (padapter->rereg_nd_name_priv.old_pnetdev);
    padapter->rereg_nd_name_priv.old_pnetdev = NULL;
  }
  
  if (padapter->pbuddy_adapter != NULL) {
    padapter->pbuddy_adapter->pbuddy_adapter = NULL;
  }
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("-rtw_free_drv_sw\n") );
  
  return _SUCCESS;
  
}

#ifdef CONFIG_CONCURRENT_MODE
#ifdef CONFIG_MULTI_VIR_IFACES
int _netdev_vir_if_open (struct net_device * pnetdev)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  _adapter * primary_padapter = GET_PRIMARY_ADAPTER (padapter);
  
  DBG_871X (FUNC_NDEV_FMT" enter\n", FUNC_NDEV_ARG (pnetdev) );
  
  if (!primary_padapter)
  { goto _netdev_virtual_iface_open_error; }
  
  if (primary_padapter->bup == _FALSE || primary_padapter->hw_init_completed == _FALSE)
  {
    _netdev_open (primary_padapter->pnetdev);
  }
  
  if (padapter->bup == _FALSE && primary_padapter->bup == _TRUE &&
      primary_padapter->hw_init_completed == _TRUE)
  {
    int i;
    
    padapter->bDriverStopped = _FALSE;
    padapter->bSurpriseRemoved = _FALSE;
    padapter->bCardDisableWOHSM = _FALSE;
    
    padapter->bFWReady = primary_padapter->bFWReady;
    
    if (rtw_start_drv_threads (padapter) == _FAIL)
    {
      goto _netdev_virtual_iface_open_error;
    }
    
    #ifdef CONFIG_IOCTL_CFG80211
    rtw_cfg80211_init_wiphy (padapter);
    #endif
    
    padapter->bup = _TRUE;
    
  }
  
  padapter->net_closed = _FALSE;
  
  _set_timer (&padapter->mlmepriv.dynamic_chk_timer, 2000);
  
  if (!rtw_netif_queue_stopped (pnetdev) )
  { rtw_netif_start_queue (pnetdev); }
  else
  { rtw_netif_wake_queue (pnetdev); }
  
  
  DBG_871X (FUNC_NDEV_FMT" exit\n", FUNC_NDEV_ARG (pnetdev) );
  return 0;
  
_netdev_virtual_iface_open_error:

  padapter->bup = _FALSE;
  
  netif_carrier_off (pnetdev);
  rtw_netif_stop_queue (pnetdev);
  
  return (-1);
  
}

int netdev_vir_if_open (struct net_device * pnetdev)
{
  int ret;
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  
  _enter_critical_mutex (& (adapter_to_dvobj (padapter)->hw_init_mutex), NULL);
  ret = _netdev_vir_if_open (pnetdev);
  _exit_critical_mutex (& (adapter_to_dvobj (padapter)->hw_init_mutex), NULL);
  
  #ifdef CONFIG_AUTO_AP_MODE
  #endif
  
  return ret;
}

static int netdev_vir_if_close (struct net_device * pnetdev)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  
  padapter->net_closed = _TRUE;
  
  if (pnetdev)
  {
    if (!rtw_netif_queue_stopped (pnetdev) )
    { rtw_netif_stop_queue (pnetdev); }
  }
  
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_scan_abort (padapter);
  adapter_wdev_data (padapter)->bandroid_scan = _FALSE;
  #endif
  
