jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  return 0;
}

#if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
static const struct net_device_ops rtw_netdev_vir_if_ops = {
  .ndo_open = netdev_vir_if_open,
  .ndo_stop = netdev_vir_if_close,
  .ndo_start_xmit = rtw_xmit_entry,
  .ndo_set_mac_address = rtw_net_set_mac_address,
  .ndo_get_stats = rtw_net_get_stats,
  .ndo_do_ioctl = rtw_ioctl,
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,35))
  .ndo_select_queue = rtw_select_queue,
  #endif
};
#endif

_adapter * rtw_drv_add_vir_if (_adapter * primary_padapter,
                               void (*set_intf_ops) (_adapter * primary_padapter, struct _io_ops * pops) )
{

  int res = _FAIL;
  struct net_device * pnetdev = NULL;
  _adapter * padapter = NULL;
  struct dvobj_priv * pdvobjpriv;
  u8 mac[ETH_ALEN];
  
  /*
    if((primary_padapter->bup == _FALSE) ||
      (rtw_buddy_adapter_up(primary_padapter) == _FALSE))
    {
      goto error_rtw_drv_add_iface;
    }
  
  */
  /****** init netdev ******/
  pnetdev = rtw_init_netdev (NULL);
  if (!pnetdev)
  { goto error_rtw_drv_add_iface; }
  
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
  DBG_871X ("register rtw_netdev_virtual_iface_ops to netdev_ops\n");
  pnetdev->netdev_ops = &rtw_netdev_vir_if_ops;
  #else
  pnetdev->open = netdev_vir_if_open;
  pnetdev->stop = netdev_vir_if_close;
  #endif
  
  #ifdef CONFIG_NO_WIRELESS_HANDLERS
  pnetdev->wireless_handlers = NULL;
  #endif
  
  /****** init adapter ******/
  padapter = rtw_netdev_priv (pnetdev);
  _rtw_memcpy (padapter, primary_padapter, sizeof (_adapter) );
  
  padapter->bup = _FALSE;
  padapter->net_closed = _TRUE;
  padapter->hw_init_completed = _FALSE;
  padapter->dir_dev = NULL;
  padapter->dir_odm = NULL;
  
  
  padapter->isprimary = _FALSE;
  padapter->adapter_type = MAX_ADAPTER;
  padapter->pbuddy_adapter = primary_padapter;
  #if 0
  #ifndef CONFIG_HWPORT_SWAP 
  padapter->iface_type = IFACE_PORT1;
  #else
  padapter->iface_type = IFACE_PORT0;
  #endif 
  #else
  padapter->iface_type = IFACE_PORT0;
  #endif
  padapter->pnetdev = pnetdev;
  
  /****** setup dvobj ******/
  pdvobjpriv = adapter_to_dvobj (padapter);
  padapter->iface_id = pdvobjpriv->iface_nums;
  pdvobjpriv->padapters[pdvobjpriv->iface_nums++] = padapter;
  
  SET_NETDEV_DEV (pnetdev, dvobj_to_dev (pdvobjpriv) );
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_wdev_alloc (padapter, dvobj_to_dev (pdvobjpriv) );
  #endif
  
  padapter->interface_type = primary_padapter->interface_type;
  padapter->chip_type = primary_padapter->chip_type;
  padapter->HardwareType = primary_padapter->HardwareType;
  
  rtw_set_hal_ops (padapter);
  
  padapter->HalFunc.inirp_init = NULL;
  padapter->HalFunc.inirp_deinit = NULL;
  padapter->intf_start = NULL;
  padapter->intf_stop = NULL;
  
  if ( (rtw_init_io_priv (padapter, set_intf_ops) ) == _FAIL) {
    RT_TRACE (_module_hci_intfs_c_, _drv_err_, (" \n Can't init io_reqs\n") );
  }
  
  rtw_hal_read_chip_version (padapter);
  
  rtw_hal_chip_configure (padapter);
  
  
  if (rtw_init_drv_sw (padapter) != _SUCCESS)
  { goto error_rtw_drv_add_iface; }
  
  
  _rtw_memcpy (mac, primary_padapter->eeprompriv.mac_addr, ETH_ALEN);
  
  if ( ( (mac[0] == 0xff) && (mac[1] == 0xff) && (mac[2] == 0xff) &&
         (mac[3] == 0xff) && (mac[4] == 0xff) && (mac[5] == 0xff) ) ||
       ( (mac[0] == 0x0) && (mac[1] == 0x0) && (mac[2] == 0x0) &&
         (mac[3] == 0x0) && (mac[4] == 0x0) && (mac[5] == 0x0) ) )
  {
    mac[0] = 0x00;
    mac[1] = 0xe0;
    mac[2] = 0x4c;
    mac[3] = 0x87;
    mac[4] = 0x11;
    mac[5] = 0x22;
  }
  else
  {
    #if 1
    mac[0] |= BIT (1);
    mac[0] |= (padapter->iface_id - 1) << 4;
    #endif
  }
  
  _rtw_memcpy (padapter->eeprompriv.mac_addr, mac, ETH_ALEN);
  
  res = _SUCCESS;
  
  return padapter;
  
  
error_rtw_drv_add_iface:

  if (padapter)
  { rtw_free_drv_sw (padapter); }
  
  if (pnetdev)
  { rtw_free_netdev (pnetdev); }
  
  return NULL;
  
}

void rtw_drv_stop_vir_if (_adapter * padapter)
{
  struct net_device * pnetdev = NULL;
  
  if (padapter == NULL)
  { return; }
  
  pnetdev = padapter->pnetdev;
  
  rtw_cancel_all_timer (padapter);
  
  if (padapter->bup == _TRUE)
  {
    padapter->bDriverStopped = _TRUE;
    
    #ifdef CONFIG_XMIT_ACK
    if (padapter->xmitpriv.ack_tx)
    { rtw_ack_tx_done (&padapter->xmitpriv, RTW_SCTX_DONE_DRV_STOP); }
    #endif
    
    if (padapter->intf_stop)
    {
      padapter->intf_stop (padapter);
    }
    
    rtw_stop_drv_threads (padapter);
    
    padapter->bup = _FALSE;
  }
}

void rtw_drv_free_vir_if (_adapter * padapter)
{
  struct net_device * pnetdev = NULL;
  
  if (padapter == NULL)
  { return; }
  
  padapter->pbuddy_adapter = NULL;
  
  pnetdev = padapter->pnetdev;
  
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_wdev_free (padapter->rtw_wdev);
  #endif
  
  rtw_free_drv_sw (padapter);
  
  rtw_free_netdev (pnetdev);
}

void rtw_drv_stop_vir_ifaces (struct dvobj_priv * dvobj)
{
  int i;
  
  for (i = 2; i < dvobj->iface_nums; i++)
  {
    rtw_drv_stop_vir_if (dvobj->padapters[i]);
  }
}

void rtw_drv_free_vir_ifaces (struct dvobj_priv * dvobj)
{
  int i;
  
  for (i = 2; i < dvobj->iface_nums; i++)
  {
    rtw_drv_free_vir_if (dvobj->padapters[i]);
  }
}

void rtw_drv_del_vir_if (_adapter * padapter)
{
  rtw_drv_stop_vir_if (padapter);
  rtw_drv_free_vir_if (padapter);
}

void rtw_drv_del_vir_ifaces (_adapter * primary_padapter)
{
  int i;
  struct dvobj_priv * dvobj = primary_padapter->dvobj;
  
  for (i = 2; i < dvobj->iface_nums; i++)
  {
    rtw_drv_del_vir_if (dvobj->padapters[i]);
  }
}
#endif

int _netdev_if2_open (struct net_device * pnetdev)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  _adapter * primary_padapter = padapter->pbuddy_adapter;
  
  DBG_871X ("+871x_drv - if2_open, bup=%d\n", padapter->bup);
  
  if (primary_padapter->bup == _FALSE || primary_padapter->hw_init_completed == _FALSE)
  {
    _netdev_open (primary_padapter->pnetdev);
  }
  
  if (padapter->bup == _FALSE && primary_padapter->bup == _TRUE &&
      primary_padapter->hw_init_completed == _TRUE)
  {
    int i;
    
