jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
    padapter->bDriverStopped = _FALSE;
    padapter->bSurpriseRemoved = _FALSE;
    padapter->bCardDisableWOHSM = _FALSE;
    
    padapter->bFWReady = primary_padapter->bFWReady;
    
    
    
    if (rtw_start_drv_threads (padapter) == _FAIL)
    {
      goto netdev_if2_open_error;
    }
    
    
    if (padapter->intf_start)
    {
      padapter->intf_start (padapter);
    }
    
    #ifdef CONFIG_IOCTL_CFG80211
    rtw_cfg80211_init_wiphy (padapter);
    #endif
    
    padapter->bup = _TRUE;
    
  }
  
  padapter->net_closed = _FALSE;
  
  
  if (!rtw_netif_queue_stopped (pnetdev) )
  { rtw_netif_start_queue (pnetdev); }
  else
  { rtw_netif_wake_queue (pnetdev); }
  
  DBG_871X ("-871x_drv - if2_open, bup=%d\n", padapter->bup);
  return 0;
  
netdev_if2_open_error:

  padapter->bup = _FALSE;
  
  netif_carrier_off (pnetdev);
  rtw_netif_stop_queue (pnetdev);
  
  return (-1);
  
}

int netdev_if2_open (struct net_device * pnetdev)
{
  int ret;
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  
  _enter_critical_mutex (& (adapter_to_dvobj (padapter)->hw_init_mutex), NULL);
  ret = _netdev_if2_open (pnetdev);
  _exit_critical_mutex (& (adapter_to_dvobj (padapter)->hw_init_mutex), NULL);
  
  #ifdef CONFIG_AUTO_AP_MODE
  rtw_start_auto_ap (padapter);
  #endif
  
  return ret;
}

static int netdev_if2_close (struct net_device * pnetdev)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  
  padapter->net_closed = _TRUE;
  
  if (pnetdev)
  {
    if (!rtw_netif_queue_stopped (pnetdev) )
    { rtw_netif_stop_queue (pnetdev); }
  }
  
  #ifdef CONFIG_P2P
  rtw_p2p_enable (padapter, P2P_ROLE_DISABLE);
  #endif
  
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_scan_abort (padapter);
  adapter_wdev_data (padapter)->bandroid_scan = _FALSE;
  #endif
  
  return 0;
}

#if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
static const struct net_device_ops rtw_netdev_if2_ops = {
  .ndo_init = rtw_ndev_init,
  .ndo_uninit = rtw_ndev_uninit,
  .ndo_open = netdev_if2_open,
  .ndo_stop = netdev_if2_close,
  .ndo_start_xmit = rtw_xmit_entry,
  .ndo_set_mac_address = rtw_net_set_mac_address,
  .ndo_get_stats = rtw_net_get_stats,
  .ndo_do_ioctl = rtw_ioctl,
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,35))
  .ndo_select_queue = rtw_select_queue,
  #endif
};
#endif

_adapter * rtw_drv_if2_init (_adapter * primary_padapter,
                             void (*set_intf_ops) (_adapter * primary_padapter, struct _io_ops * pops) )
{
  int res = _FAIL;
  struct net_device * pnetdev = NULL;
  _adapter * padapter = NULL;
  struct dvobj_priv * pdvobjpriv;
  u8 mac[ETH_ALEN];
  
  /****** init netdev ******/
  pnetdev = rtw_init_netdev (NULL);
  if (!pnetdev)
  { goto error_rtw_drv_if2_init; }
  
  #if (LINUX_VERSION_CODE>=KERNEL_VERSION(2,6,29))
  DBG_871X ("register rtw_netdev_if2_ops to netdev_ops\n");
  pnetdev->netdev_ops = &rtw_netdev_if2_ops;
  #else
  pnetdev->init = rtw_ndev_init;
  pnetdev->uninit = rtw_ndev_uninit;
  pnetdev->open = netdev_if2_open;
  pnetdev->stop = netdev_if2_close;
  #endif
  
  #ifdef CONFIG_NO_WIRELESS_HANDLERS
  pnetdev->wireless_handlers = NULL;
  #endif
  
  /****** init adapter ******/
  padapter = rtw_netdev_priv (pnetdev);
  _rtw_memcpy (padapter, primary_padapter, sizeof (_adapter) );
  
  padapter->bup = _FALSE;
  padapter->net_closed = _TRUE;
  padapter->hw_init_completed = _FALSE;
  padapter->dir_dev = NULL;
  padapter->dir_odm = NULL;
  
  padapter->isprimary = _FALSE;
  padapter->adapter_type = SECONDARY_ADAPTER;
  padapter->pbuddy_adapter = primary_padapter;
  padapter->iface_id = IFACE_ID1;
  #ifndef CONFIG_HWPORT_SWAP     
  padapter->iface_type = IFACE_PORT1;
  #else
  padapter->iface_type = IFACE_PORT0;
  #endif 
  padapter->pnetdev = pnetdev;
  
  /****** setup dvobj ******/
  pdvobjpriv = adapter_to_dvobj (padapter);
  pdvobjpriv->if2 = padapter;
  pdvobjpriv->padapters[pdvobjpriv->iface_nums++] = padapter;
  
  SET_NETDEV_DEV (pnetdev, dvobj_to_dev (pdvobjpriv) );
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_wdev_alloc (padapter, dvobj_to_dev (pdvobjpriv) );
  #endif
  
  padapter->interface_type = primary_padapter->interface_type;
  padapter->chip_type = primary_padapter->chip_type;
  padapter->HardwareType = primary_padapter->HardwareType;
  
  rtw_set_hal_ops (padapter);
  
  padapter->HalFunc.inirp_init = NULL;
  padapter->HalFunc.inirp_deinit = NULL;
  
  padapter->intf_start = primary_padapter->intf_start;
  padapter->intf_stop = primary_padapter->intf_stop;
  
  if ( (rtw_init_io_priv (padapter, set_intf_ops) ) == _FAIL) {
    RT_TRACE (_module_hci_intfs_c_, _drv_err_, (" \n Can't init io_reqs\n") );
  }
  
  rtw_hal_read_chip_version (padapter);
  
  rtw_hal_chip_configure (padapter);
  
  
  if (rtw_init_drv_sw (padapter) != _SUCCESS)
  { goto error_rtw_drv_if2_init; }
  
  
  _rtw_memcpy (mac, primary_padapter->eeprompriv.mac_addr, ETH_ALEN);
  
  if ( ( (mac[0] == 0xff) && (mac[1] == 0xff) && (mac[2] == 0xff) &&
         (mac[3] == 0xff) && (mac[4] == 0xff) && (mac[5] == 0xff) ) ||
       ( (mac[0] == 0x0) && (mac[1] == 0x0) && (mac[2] == 0x0) &&
         (mac[3] == 0x0) && (mac[4] == 0x0) && (mac[5] == 0x0) ) )
  {
    mac[0] = 0x00;
    mac[1] = 0xe0;
    mac[2] = 0x4c;
    mac[3] = 0x87;
    mac[4] = 0x11;
    mac[5] = 0x22;
  }
  else
  {
    mac[0] |= BIT (1);
    
  }
  
  _rtw_memcpy (padapter->eeprompriv.mac_addr, mac, ETH_ALEN);
  rtw_init_wifidirect_addrs (padapter, padapter->eeprompriv.mac_addr, padapter->eeprompriv.mac_addr);
  
  primary_padapter->pbuddy_adapter = padapter;
  
  res = _SUCCESS;
  
  return padapter;
  
  
error_rtw_drv_if2_init:

  if (padapter)
  { rtw_free_drv_sw (padapter); }
  
  if (pnetdev)
  { rtw_free_netdev (pnetdev); }
  
  return NULL;
  
}

void rtw_drv_if2_free (_adapter * if2)
{
  _adapter * padapter = if2;
  struct net_device * pnetdev = NULL;
  
  if (padapter == NULL)
  { return; }
  
  pnetdev = padapter->pnetdev;
  
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_wdev_free (padapter->rtw_wdev);
  #endif /* CONFIG_IOCTL_CFG80211 */
  
  
  rtw_free_drv_sw (padapter);
  
