jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  rtw_free_netdev (pnetdev);
  
}

void rtw_drv_if2_stop (_adapter * if2)
{
  _adapter * padapter = if2;
  struct net_device * pnetdev = NULL;
  
  if (padapter == NULL)
  { return; }
  
  rtw_cancel_all_timer (padapter);
  
  if (padapter->bup == _TRUE) {
    padapter->bDriverStopped = _TRUE;
    #ifdef CONFIG_XMIT_ACK
    if (padapter->xmitpriv.ack_tx)
    { rtw_ack_tx_done (&padapter->xmitpriv, RTW_SCTX_DONE_DRV_STOP); }
    #endif
    
    if (padapter->intf_stop)
    {
      padapter->intf_stop (padapter);
    }
    
    rtw_stop_drv_threads (padapter);
    
    padapter->bup = _FALSE;
  }
}
#endif

#ifdef CONFIG_BR_EXT
void netdev_br_init (struct net_device * netdev)
{
  _adapter * adapter = (_adapter *) rtw_netdev_priv (netdev);
  
  #if (LINUX_VERSION_CODE > KERNEL_VERSION(2, 6, 35))
  rcu_read_lock();
  #endif 
  
  {
    #if (LINUX_VERSION_CODE <= KERNEL_VERSION(2, 6, 35))
    if (netdev->br_port)
    #else  
    if (rcu_dereference (adapter->pnetdev->rx_handler_data) )
    #endif 
    {
      struct net_device * br_netdev;
      #if (LINUX_VERSION_CODE < KERNEL_VERSION(2,6,24))
      br_netdev = dev_get_by_name (CONFIG_BR_EXT_BRNAME);
      #else
      struct net * devnet = NULL;
      
      #if (LINUX_VERSION_CODE < KERNEL_VERSION(2,6,26))
      devnet = netdev->nd_net;
      #else
      devnet = dev_net (netdev);
      #endif 
      
      br_netdev = dev_get_by_name (devnet, CONFIG_BR_EXT_BRNAME);
      #endif 
      
      if (br_netdev) {
        memcpy (adapter->br_mac, br_netdev->dev_addr, ETH_ALEN);
        dev_put (br_netdev);
      }
      else
      { printk ("%s()-%d: dev_get_by_name(%s) failed!", __FUNCTION__, __LINE__, CONFIG_BR_EXT_BRNAME); }
    }
    
    adapter->ethBrExtInfo.addPPPoETag = 1;
  }
  
  #if (LINUX_VERSION_CODE > KERNEL_VERSION(2, 6, 35))
  rcu_read_unlock();
  #endif 
}
#endif

static int _rtw_drv_register_netdev (_adapter * padapter, char * name)
{
  int ret = _SUCCESS;
  struct net_device * pnetdev = padapter->pnetdev;
  
  /* alloc netdev name */
  rtw_init_netdev_name (pnetdev, name);
  
  _rtw_memcpy (pnetdev->dev_addr, padapter->eeprompriv.mac_addr, ETH_ALEN);
  
  /* Tell the network stack we exist */
  if (register_netdev (pnetdev) != 0) {
    DBG_871X (FUNC_NDEV_FMT "Failed!\n", FUNC_NDEV_ARG (pnetdev) );
    ret = _FAIL;
    goto error_register_netdev;
  }
  
  DBG_871X ("%s, MAC Address (if%d) = " MAC_FMT "\n", __FUNCTION__, (padapter->iface_id + 1), MAC_ARG (pnetdev->dev_addr) );
  
  return ret;
  
error_register_netdev:

  if (padapter->iface_id > IFACE_ID0)
  {
    rtw_free_drv_sw (padapter);
    
    rtw_free_netdev (pnetdev);
  }
  
  return ret;
}

int rtw_drv_register_netdev (_adapter * if1)
{
  int i, status = _SUCCESS;
  struct dvobj_priv * dvobj = if1->dvobj;
  
  if (dvobj->iface_nums < IFACE_ID_MAX)
  {
    for (i = 0; i < dvobj->iface_nums; i++)
    {
      _adapter * padapter = dvobj->padapters[i];
      
      if (padapter)
      {
        char * name;
        
        if (padapter->iface_id == IFACE_ID0)
        { name = if1->registrypriv.ifname; }
        else
          if (padapter->iface_id == IFACE_ID1)
          { name = if1->registrypriv.if2name; }
          else
          { name = "wlan%d"; }
          
        if ( (status = _rtw_drv_register_netdev (padapter, name) ) != _SUCCESS) {
          break;
        }
      }
    }
  }
  
  return status;
}

int _netdev_open (struct net_device * pnetdev)
{
  uint status;
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  struct pwrctrl_priv * pwrctrlpriv = adapter_to_pwrctl (padapter);
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+871x_drv - dev_open\n") );
  DBG_871X ("+871x_drv - drv_open, bup=%d\n", padapter->bup);
  
  padapter->netif_up = _TRUE;
  
  if (pwrctrlpriv->ps_flag == _TRUE) {
    padapter->net_closed = _FALSE;
    goto netdev_open_normal_process;
  }
  
  if (padapter->bup == _FALSE)
  {
    padapter->bDriverStopped = _FALSE;
    padapter->bSurpriseRemoved = _FALSE;
    padapter->bCardDisableWOHSM = _FALSE;
    
    status = rtw_hal_init (padapter);
    if (status == _FAIL)
    {
      RT_TRACE (_module_os_intfs_c_, _drv_err_, ("rtl871x_hal_init(): Can't init h/w!\n") );
      goto netdev_open_error;
    }
    
    DBG_871X ("MAC Address = "MAC_FMT"\n", MAC_ARG (pnetdev->dev_addr) );
    
    #ifdef CONFIG_RF_GAIN_OFFSET
    rtw_bb_rf_gain_offset (padapter);
    #endif
    
    status = rtw_start_drv_threads (padapter);
    if (status == _FAIL)
    {
      DBG_871X ("Initialize driver software resource Failed!\n");
      goto netdev_open_error;
    }
    
    #ifdef CONFIG_DRVEXT_MODULE
    init_drvext (padapter);
    #endif
    
    if (padapter->intf_start)
    {
      padapter->intf_start (padapter);
    }
    
    #ifdef CONFIG_IOCTL_CFG80211
    rtw_cfg80211_init_wiphy (padapter);
    #endif
    
    rtw_led_control (padapter, LED_CTL_NO_LINK);
    
    padapter->bup = _TRUE;
    pwrctrlpriv->bips_processing = _FALSE;
  }
  padapter->net_closed = _FALSE;
  
  _set_timer (&padapter->mlmepriv.dynamic_chk_timer, 2000);
  
  #ifndef CONFIG_IPS_CHECK_IN_WD
  rtw_set_pwr_state_check_timer (pwrctrlpriv);
  #endif
  
  if (!rtw_netif_queue_stopped (pnetdev) )
  { rtw_netif_start_queue (pnetdev); }
  else
  { rtw_netif_wake_queue (pnetdev); }
  
  #ifdef CONFIG_BR_EXT
  netdev_br_init (pnetdev);
  #endif 
  
netdev_open_normal_process:

  #ifdef CONFIG_CONCURRENT_MODE
  {
    _adapter * sec_adapter = padapter->pbuddy_adapter;
    if (sec_adapter && (sec_adapter->bup == _FALSE) )
    { _netdev_if2_open (sec_adapter->pnetdev); }
  }
  #endif
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("-871x_drv - dev_open\n") );
  DBG_871X ("-871x_drv - drv_open, bup=%d\n", padapter->bup);
  
  return 0;
  
netdev_open_error:

  padapter->bup = _FALSE;
  
  netif_carrier_off (pnetdev);
  rtw_netif_stop_queue (pnetdev);
  
  RT_TRACE (_module_os_intfs_c_, _drv_err_, ("-871x_drv - dev_open, fail!\n") );
  DBG_871X ("-871x_drv - drv_open fail, bup=%d\n", padapter->bup);
  
  return (-1);
  
