jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
}

int netdev_open (struct net_device * pnetdev)
{
  int ret;
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  
  _enter_critical_mutex (& (adapter_to_dvobj (padapter)->hw_init_mutex), NULL);
  ret = _netdev_open (pnetdev);
  _exit_critical_mutex (& (adapter_to_dvobj (padapter)->hw_init_mutex), NULL);
  
  return ret;
}

#ifdef CONFIG_IPS
int  ips_netdrv_open (_adapter * padapter)
{
  int status = _SUCCESS;
  
  padapter->net_closed = _FALSE;
  
  DBG_871X ("===> %s.........\n", __FUNCTION__);
  
  
  padapter->bDriverStopped = _FALSE;
  padapter->bCardDisableWOHSM = _FALSE;
  
  status = rtw_hal_init (padapter);
  if (status == _FAIL)
  {
    RT_TRACE (_module_os_intfs_c_, _drv_err_, ("ips_netdrv_open(): Can't init h/w!\n") );
    goto netdev_open_error;
  }
  
  #ifdef CONFIG_RF_GAIN_OFFSET
  rtw_bb_rf_gain_offset (padapter);
  #endif
  
  if (padapter->intf_start)
  {
    padapter->intf_start (padapter);
  }
  
  #ifndef CONFIG_IPS_CHECK_IN_WD
  rtw_set_pwr_state_check_timer (adapter_to_pwrctl (padapter) );
  #endif
  _set_timer (&padapter->mlmepriv.dynamic_chk_timer, 2000);
  
  return _SUCCESS;
  
netdev_open_error:
  DBG_871X ("-ips_netdrv_open - drv_open failure, bup=%d\n", padapter->bup);
  
  return _FAIL;
}


int rtw_ips_pwr_up (_adapter * padapter)
{
  int result;
  PHAL_DATA_TYPE pHalData = GET_HAL_DATA (padapter);
  #ifdef DBG_CONFIG_ERROR_DETECT
  struct sreset_priv * psrtpriv = &pHalData->srestpriv;
  #endif//#ifdef DBG_CONFIG_ERROR_DETECT
  u32 start_time = rtw_get_current_time();
  DBG_871X ("===>  rtw_ips_pwr_up..............\n");
  
  #if defined(CONFIG_SWLPS_IN_IPS) || defined(CONFIG_FWLPS_IN_IPS)
  #ifdef DBG_CONFIG_ERROR_DETECT
  if (psrtpriv->silent_reset_inprogress == _TRUE)
  #endif//#ifdef DBG_CONFIG_ERROR_DETECT
  #endif
    rtw_reset_drv_sw (padapter);
    
  result = ips_netdrv_open (padapter);
  
  rtw_led_control (padapter, LED_CTL_NO_LINK);
  
  DBG_871X ("<===  rtw_ips_pwr_up.............. in %dms\n", rtw_get_passing_time_ms (start_time) );
  return result;
  
}

void rtw_ips_pwr_down (_adapter * padapter)
{
  u32 start_time = rtw_get_current_time();
  DBG_871X ("===> rtw_ips_pwr_down...................\n");
  
  padapter->bCardDisableWOHSM = _TRUE;
  padapter->net_closed = _TRUE;
  
  rtw_ips_dev_unload (padapter);
  padapter->bCardDisableWOHSM = _FALSE;
  DBG_871X ("<=== rtw_ips_pwr_down..................... in %dms\n", rtw_get_passing_time_ms (start_time) );
}
#endif
void rtw_ips_dev_unload (_adapter * padapter)
{
  struct net_device * pnetdev = (struct net_device *) padapter->pnetdev;
  struct xmit_priv * pxmitpriv = & (padapter->xmitpriv);
  PHAL_DATA_TYPE pHalData = GET_HAL_DATA (padapter);
  #ifdef DBG_CONFIG_ERROR_DETECT
  struct sreset_priv * psrtpriv = &pHalData->srestpriv;
  #endif//#ifdef DBG_CONFIG_ERROR_DETECT
  DBG_871X ("====> %s...\n", __FUNCTION__);
  
  
  #if defined(CONFIG_SWLPS_IN_IPS) || defined(CONFIG_FWLPS_IN_IPS)
  #ifdef DBG_CONFIG_ERROR_DETECT
  if (psrtpriv->silent_reset_inprogress == _TRUE)
  #endif
  #endif
  {
    rtw_hal_set_hwreg (padapter, HW_VAR_FIFO_CLEARN_UP, 0);
    
    if (padapter->intf_stop)
    {
      padapter->intf_stop (padapter);
    }
  }
  
  if (padapter->bSurpriseRemoved == _FALSE)
  {
    rtw_hal_deinit (padapter);
  }
  
}

#ifdef CONFIG_RF_GAIN_OFFSET
u32 Array_kfreemap[] = {
  0xf8, 0xe,
  0xf6, 0xc,
  0xf4, 0xa,
  0xf2, 0x8,
  0xf0, 0x6,
  0xf3, 0x4,
  0xf5, 0x2,
  0xf7, 0x0,
  0xf9, 0x0,
  0xfc, 0x0,
};

void rtw_bb_rf_gain_offset (_adapter * padapter)
{
  u8    value = padapter->eeprompriv.EEPROMRFGainOffset;
  u8    tmp = 0x3e;
  u32   res, i = 0;
  u4Byte     ArrayLen    = sizeof (Array_kfreemap) / sizeof (u32);
  pu4Byte    Array     = Array_kfreemap;
  u4Byte v1 = 0, v2 = 0, target = 0;
  #if defined(CONFIG_RTL8723A)
  if (value & BIT0) {
    DBG_871X ("Offset RF Gain.\n");
    DBG_871X ("Offset RF Gain.  padapter->eeprompriv.EEPROMRFGainVal=0x%x\n", padapter->eeprompriv.EEPROMRFGainVal);
    if (padapter->eeprompriv.EEPROMRFGainVal != 0xff) {
      res = rtw_hal_read_rfreg (padapter, RF_PATH_A, 0xd, 0xffffffff);
      DBG_871X ("Offset RF Gain. reg 0xd=0x%x\n", res);
      res &= 0xfff87fff;
      
      res |= (padapter->eeprompriv.EEPROMRFGainVal & 0x0f) << 15;
      DBG_871X ("Offset RF Gain.	 reg 0xd=0x%x\n", res);
      
      rtw_hal_write_rfreg (padapter, RF_PATH_A, REG_RF_BB_GAIN_OFFSET_CCK, RF_GAIN_OFFSET_MASK, res);
      
      res = rtw_hal_read_rfreg (padapter, RF_PATH_A, 0xe, 0xffffffff);
      DBG_871X ("Offset RF Gain. reg 0xe=0x%x\n", res);
      res &= 0xfffffff0;
      
      res |= (padapter->eeprompriv.EEPROMRFGainVal & 0x0f);
      DBG_871X ("Offset RF Gain.	 reg 0xe=0x%x\n", res);
      
      rtw_hal_write_rfreg (padapter, RF_PATH_A, REG_RF_BB_GAIN_OFFSET_OFDM, RF_GAIN_OFFSET_MASK, res);
    }
    else
    {
      DBG_871X ("Offset RF Gain.  padapter->eeprompriv.EEPROMRFGainVal=0x%x	!= 0xff, didn't run Kfree\n", padapter->eeprompriv.EEPROMRFGainVal);
    }
  }
  else {
    DBG_871X ("Using the default RF gain.\n");
  }
  #elif defined(CONFIG_RTL8723B)
  if (value & BIT4) {
    DBG_871X ("Offset RF Gain.\n");
    DBG_871X ("Offset RF Gain.  padapter->eeprompriv.EEPROMRFGainVal=0x%x\n", padapter->eeprompriv.EEPROMRFGainVal);
    if (padapter->eeprompriv.EEPROMRFGainVal != 0xff) {
      res = rtw_hal_read_rfreg (padapter, RF_PATH_A, 0x7f, 0xffffffff);
      res &= 0xfff87fff;
      DBG_871X ("Offset RF Gain. before reg 0x7f=0x%08x\n", res);
      for (i = 0; i < ArrayLen; i += 2 )
      {
        v1 = Array[i];
        v2 = Array[i + 1];
        if ( v1 == padapter->eeprompriv.EEPROMRFGainVal )
        {
          DBG_871X ("Offset RF Gain. got v1 =0x%x ,v2 =0x%x \n", v1, v2);
          target = v2;
          break;
        }
      }
      DBG_871X ("padapter->eeprompriv.EEPROMRFGainVal=0x%x ,Gain offset Target Value=0x%x\n", padapter->eeprompriv.EEPROMRFGainVal, target);
      PHY_SetRFReg (padapter, RF_PATH_A, REG_RF_BB_GAIN_OFFSET, BIT18 | BIT17 | BIT16 | BIT15, target);
  
      res = rtw_hal_read_rfreg (padapter, RF_PATH_A, 0x7f, 0xffffffff);
      DBG_871X ("Offset RF Gain. After reg 0x7f=0x%08x\n", res);
    }
    else
    {
      DBG_871X ("Offset RF Gain.  padapter->eeprompriv.EEPROMRFGainVal=0x%x	!= 0xff, didn't run Kfree\n", padapter->eeprompriv.EEPROMRFGainVal);
    }
  }
  else {
    DBG_871X ("Using the default RF gain.\n");
  }
  #else
  if (! (value & 0x01) ) {
    res = rtw_hal_read_rfreg (padapter, RF_PATH_A, REG_RF_BB_GAIN_OFFSET, 0xffffffff);
    value &= tmp;
    res = value << 14;
    rtw_hal_write_rfreg (padapter, RF_PATH_A, REG_RF_BB_GAIN_OFFSET, RF_GAIN_OFFSET_MASK, res);
  }
  else {
    DBG_871X ("Using the default RF gain.\n");
  }
  #endif
  
