jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
}
#endif


int pm_netdev_open (struct net_device * pnetdev, u8 bnormal)
{
  int status = 0;
  
  
  if (_TRUE == bnormal)
  { status = netdev_open (pnetdev); }
  #ifdef CONFIG_IPS
  else
  { status =  (_SUCCESS == ips_netdrv_open ( (_adapter *) rtw_netdev_priv (pnetdev) ) ) ? (0) : (-1); }
  #endif
  
  return status;
}

static int netdev_close (struct net_device * pnetdev)
{
  _adapter * padapter = (_adapter *) rtw_netdev_priv (pnetdev);
  struct pwrctrl_priv * pwrctl = adapter_to_pwrctl (padapter);
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("+871x_drv - drv_close\n") );
  
  if (pwrctl->bInternalAutoSuspend == _TRUE)
  {
    if (pwrctl->rf_pwrstate == rf_off)
    { pwrctl->ps_flag = _TRUE; }
  }
  padapter->net_closed = _TRUE;
  padapter->netif_up = _FALSE;
  
  /*  if(!padapter->hw_init_completed)
    {
      DBG_871X("(1)871x_drv - drv_close, bup=%d, hw_init_completed=%d\n", padapter->bup, padapter->hw_init_completed);
  
      padapter->bDriverStopped = _TRUE;
  
      rtw_dev_unload(padapter);
    }
    else*/
  if (pwrctl->rf_pwrstate == rf_on) {
    DBG_871X ("(2)871x_drv - drv_close, bup=%d, hw_init_completed=%d\n", padapter->bup, padapter->hw_init_completed);
    
    if (pnetdev)
    {
      if (!rtw_netif_queue_stopped (pnetdev) )
      { rtw_netif_stop_queue (pnetdev); }
    }
    
    #ifndef CONFIG_ANDROID
    LeaveAllPowerSaveMode (padapter);
    rtw_disassoc_cmd (padapter, 500, _FALSE);
    rtw_indicate_disconnect (padapter);
    rtw_free_assoc_resources (padapter, 1);
    rtw_free_network_queue (padapter, _TRUE);
    #endif
    rtw_led_control (padapter, LED_CTL_POWER_OFF);
  }
  
  #ifdef CONFIG_BR_EXT
  {
    nat25_db_cleanup (padapter);
  }
  #endif 
  
  #ifdef CONFIG_P2P
  rtw_p2p_enable (padapter, P2P_ROLE_DISABLE);
  #endif
  
  #ifdef CONFIG_IOCTL_CFG80211
  rtw_scan_abort (padapter);
  adapter_wdev_data (padapter)->bandroid_scan = _FALSE;
  #endif
  
  #ifdef CONFIG_WAPI_SUPPORT
  rtw_wapi_disable_tx (padapter);
  #endif
  
  RT_TRACE (_module_os_intfs_c_, _drv_info_, ("-871x_drv - drv_close\n") );
  DBG_871X ("-871x_drv - drv_close, bup=%d\n", padapter->bup);
  
  return 0;
  
}

int pm_netdev_close (struct net_device * pnetdev, u8 bnormal)
{
  int status = 0;
  
  status = netdev_close (pnetdev);
  
  return status;
}

void rtw_ndev_destructor (struct net_device * ndev)
{
  DBG_871X (FUNC_NDEV_FMT"\n", FUNC_NDEV_ARG (ndev) );
  
  #ifdef CONFIG_IOCTL_CFG80211
  if (ndev->ieee80211_ptr)
  { rtw_mfree ( (u8 *) ndev->ieee80211_ptr, sizeof (struct wireless_dev) ); }
  #endif
  free_netdev (ndev);
}

void rtw_dev_unload (PADAPTER padapter)
{
  struct net_device * pnetdev = (struct net_device *) padapter->pnetdev;
  struct pwrctrl_priv * pwrctl = adapter_to_pwrctl (padapter);
  struct dvobj_priv * pobjpriv = padapter->dvobj;
  struct debug_priv * pdbgpriv = &pobjpriv->drv_dbg;
  
  RT_TRACE (_module_hci_intfs_c_, _drv_notice_, ("+%s\n", __FUNCTION__) );
  
  if (padapter->bup == _TRUE)
  {
    DBG_871X ("===> %s\n", __FUNCTION__);
    
    padapter->bDriverStopped = _TRUE;
    #ifdef CONFIG_XMIT_ACK
    if (padapter->xmitpriv.ack_tx)
    { rtw_ack_tx_done (&padapter->xmitpriv, RTW_SCTX_DONE_DRV_STOP); }
    #endif
    
    if (padapter->intf_stop)
    { padapter->intf_stop (padapter); }
    
    RT_TRACE (_module_hci_intfs_c_, _drv_notice_, ("@ rtw_dev_unload: stop intf complete!\n") );
    
    if (!pwrctl->bInternalAutoSuspend)
    { rtw_stop_drv_threads (padapter); }
    
    RT_TRACE (_module_hci_intfs_c_, _drv_notice_, ("@ %s: stop thread complete!\n", __FUNCTION__) );
    
    if (rtw_hal_check_ips_status (padapter) == _TRUE || pwrctl->rf_pwrstate == rf_off) {
      DBG_871X_LEVEL (_drv_always_, "%s: driver in IPS-FWLPS\n", __func__);
      pdbgpriv->dbg_dev_unload_inIPS_cnt++;
      LeaveAllPowerSaveMode (padapter);
    }
    else {
      DBG_871X_LEVEL (_drv_always_, "%s: driver not in IPS\n", __func__);
    }
    
    if (padapter->bSurpriseRemoved == _FALSE)
    {
      #ifdef CONFIG_WOWLAN
      if (pwrctl->bSupportRemoteWakeup == _TRUE &&
          pwrctl->wowlan_mode == _TRUE) {
        DBG_871X_LEVEL (_drv_always_, "%s bSupportRemoteWakeup==_TRUE  do not run rtw_hal_deinit()\n", __FUNCTION__);
      }
      else
      #endif
      {
        rtw_hal_deinit (padapter);
      }
      padapter->bSurpriseRemoved = _TRUE;
    }
    RT_TRACE (_module_hci_intfs_c_, _drv_notice_, ("@ %s: deinit hal complelt!\n", __FUNCTION__) );
    
    padapter->bup = _FALSE;
    
    DBG_871X ("<=== %s\n", __FUNCTION__);
  }
  else {
    RT_TRACE (_module_hci_intfs_c_, _drv_notice_, ("%s: bup==_FALSE\n", __FUNCTION__) );
    DBG_871X ("%s: bup==_FALSE\n", __FUNCTION__);
  }
  
  RT_TRACE (_module_hci_intfs_c_, _drv_notice_, ("-%s\n", __FUNCTION__) );
}

#ifdef CONFIG_SUSPEND_REFINE
int rtw_suspend_free_assoc_resource (_adapter * padapter)
{
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct net_device * pnetdev = padapter->pnetdev;
  struct wifidirect_info * pwdinfo = &padapter->wdinfo;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  
  if (rtw_chk_roam_flags (padapter, RTW_ROAM_ON_RESUME) ) {
    if (check_fwstate (pmlmepriv, WIFI_STATION_STATE)
        && check_fwstate (pmlmepriv, _FW_LINKED)
        && rtw_p2p_chk_state (pwdinfo, P2P_STATE_NONE) )
    {
      DBG_871X ("%s %s(" MAC_FMT "), length:%d assoc_ssid.length:%d\n", __FUNCTION__,
                pmlmepriv->cur_network.network.Ssid.Ssid,
                MAC_ARG (pmlmepriv->cur_network.network.MacAddress),
                pmlmepriv->cur_network.network.Ssid.SsidLength,
                pmlmepriv->assoc_ssid.SsidLength);
      rtw_set_to_roam (padapter, 1);
    }
  }
  
  if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) && check_fwstate (pmlmepriv, _FW_LINKED) )
  {
    rtw_disassoc_cmd (padapter, 0, _FALSE);
    rtw_indicate_disconnect (padapter);
  }
  #ifdef CONFIG_AP_MODE
  else
    if (check_fwstate (pmlmepriv, WIFI_AP_STATE) )
    {
      rtw_sta_flush (padapter);
    }
  #endif
    
  rtw_free_assoc_resources (padapter, 1);
  
