jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  #ifdef CONFIG_AUTOSUSPEND
  if (is_primary_adapter (padapter) && (!adapter_to_pwrctl (padapter)->bInternalAutoSuspend ) )
  #endif
    rtw_free_network_queue (padapter, _TRUE);
    
  if (check_fwstate (pmlmepriv, _FW_UNDER_SURVEY) )
  { rtw_indicate_scan_done (padapter, 1); }
  
  if (check_fwstate (pmlmepriv, _FW_UNDER_LINKING) == _TRUE)
  {
    DBG_871X_LEVEL (_drv_always_, "%s: fw_under_linking\n", __FUNCTION__);
    rtw_indicate_disconnect (padapter);
  }
  
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  return _SUCCESS;
}

#ifdef CONFIG_WOWLAN
int rtw_suspend_wow (_adapter * padapter)
{
  u8 ch, bw, offset;
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct net_device * pnetdev = padapter->pnetdev;
  #ifdef CONFIG_CONCURRENT_MODE
  struct net_device * pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
  #endif
  struct dvobj_priv * psdpriv = padapter->dvobj;
  struct debug_priv * pdbgpriv = &psdpriv->drv_dbg;
  struct pwrctrl_priv * pwrpriv = adapter_to_pwrctl (padapter);
  struct wowlan_ioctl_param poidparam;
  u8 ps_mode;
  int ret = _SUCCESS;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  
  if (check_fwstate (pmlmepriv, _FW_LINKED) ) {
    pwrpriv->wowlan_mode = _TRUE;
  }
  else
    if (pwrpriv->wowlan_pno_enable == _TRUE) {
      pwrpriv->wowlan_mode |= pwrpriv->wowlan_pno_enable;
    }
    
  DBG_871X ("wowlan_mode: %d\n", pwrpriv->wowlan_mode);
  DBG_871X ("wowlan_pno_enable: %d\n", pwrpriv->wowlan_pno_enable);
  
  if (pwrpriv->wowlan_mode == _TRUE) {
    if (pnetdev)
    { rtw_netif_stop_queue (pnetdev); }
    #ifdef CONFIG_CONCURRENT_MODE
    if (pbuddy_netdev) {
      netif_carrier_off (pbuddy_netdev);
      rtw_netif_stop_queue (pbuddy_netdev);
    }
    #endif//CONFIG_CONCURRENT_MODE
    padapter->bDriverStopped = _TRUE;
    rtw_stop_drv_threads (padapter);
    padapter->bDriverStopped = _FALSE; 
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      padapter->pbuddy_adapter->bDriverStopped = _TRUE;
      rtw_stop_drv_threads (padapter->pbuddy_adapter);
      padapter->pbuddy_adapter->bDriverStopped = _FALSE; 
    }
    #endif
    
    
    #ifdef CONFIG_SDIO_HCI
    if (padapter->intf_stop) {
      padapter->intf_stop (padapter);
    }
    
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      padapter->pbuddy_adapter->intf_stop (padapter->pbuddy_adapter);
    }
    #endif
    
    if (padapter->HalFunc.clear_interrupt)
    { padapter->HalFunc.clear_interrupt (padapter); }
    #endif
    
    if (padapter->intf_free_irq)
    { padapter->intf_free_irq (adapter_to_dvobj (padapter) ); }
    
    #ifdef CONFIG_RUNTIME_PORT_SWITCH
    if (rtw_port_switch_chk (padapter) ) {
      DBG_871X (" ### PORT SWITCH ### \n");
      rtw_hal_set_hwreg (padapter, HW_VAR_PORT_SWITCH, NULL);
    }
    #endif
    
    poidparam.subcode = WOWLAN_ENABLE;
    padapter->HalFunc.SetHwRegHandler (padapter, HW_VAR_WOWLAN, (u8 *) &poidparam);
    if (rtw_chk_roam_flags (padapter, RTW_ROAM_ON_RESUME) ) {
      if (check_fwstate (pmlmepriv, WIFI_STATION_STATE)
          && check_fwstate (pmlmepriv, _FW_LINKED) )
      {
        DBG_871X ("%s %s(" MAC_FMT "), length:%d assoc_ssid.length:%d\n", __FUNCTION__,
                  pmlmepriv->cur_network.network.Ssid.Ssid,
                  MAC_ARG (pmlmepriv->cur_network.network.MacAddress),
                  pmlmepriv->cur_network.network.Ssid.SsidLength,
                  pmlmepriv->assoc_ssid.SsidLength);
                  
        rtw_set_to_roam (padapter, 0);
      }
    }
    
    DBG_871X_LEVEL (_drv_always_, "%s: wowmode suspending\n", __func__);
    
    if (check_fwstate (pmlmepriv, _FW_UNDER_SURVEY) == _TRUE)
    {
      DBG_871X_LEVEL (_drv_always_, "%s: fw_under_survey\n", __func__);
      rtw_indicate_scan_done (padapter, 1);
      clr_fwstate (pmlmepriv, _FW_UNDER_SURVEY);
    }
    
    if (rtw_get_ch_setting_union (padapter, &ch, &bw, &offset) != 0) {
      DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
                FUNC_ADPT_ARG (padapter), ch, bw, offset);
      set_channel_bwmode (padapter, ch, offset, bw);
    }
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      rtw_suspend_free_assoc_resource (padapter->pbuddy_adapter);
    }
    #endif
    
    #ifdef CONFIG_POWER_SAVING
    if (pwrpriv->wowlan_pno_enable)
    { DBG_871X_LEVEL (_drv_always_, "%s: pno: %d\n", __func__, pwrpriv->wowlan_pno_enable); }
    else
    { rtw_set_ps_mode (padapter, PS_MODE_DTIM, 0, 0, "WOWLAN"); }
    #endif
    
  }
  else
  {
    if (pnetdev) {
      netif_carrier_off (pnetdev);
      rtw_netif_stop_queue (pnetdev);
    }
    #ifdef CONFIG_CONCURRENT_MODE
    if (pbuddy_netdev) {
      netif_carrier_off (pbuddy_netdev);
      rtw_netif_stop_queue (pbuddy_netdev);
    }
    #endif//CONFIG_CONCURRENT_MODE
    
    rtw_suspend_free_assoc_resource (padapter);
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      rtw_suspend_free_assoc_resource (padapter->pbuddy_adapter);
    }
    #endif//CONFIG_CONCURRENT_MODE
    rtw_led_control (padapter, LED_CTL_POWER_OFF);
    
    
    if ( (rtw_hal_check_ips_status (padapter) == _TRUE)
         || (adapter_to_pwrctl (padapter)->rf_pwrstate == rf_off) )
    {
      DBG_871X_LEVEL (_drv_always_, "%s: ### ERROR #### driver in IPS ####ERROR###!!!\n", __FUNCTION__);
      
    }
    
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      rtw_dev_unload (padapter->pbuddy_adapter);
    }
    #endif
    rtw_dev_unload (padapter);
    
    if (padapter->intf_deinit)
    { padapter->intf_deinit (adapter_to_dvobj (padapter) ); }
  }
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  return ret;
}
#endif

#ifdef CONFIG_AP_WOWLAN
int rtw_suspend_ap_wow (_adapter * padapter)
{
  u8 ch, bw, offset;
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct net_device * pnetdev = padapter->pnetdev;
  #ifdef CONFIG_CONCURRENT_MODE
  struct net_device * pbuddy_netdev;
  #endif
  struct dvobj_priv * psdpriv = padapter->dvobj;
  struct debug_priv * pdbgpriv = &psdpriv->drv_dbg;
  struct pwrctrl_priv * pwrpriv = adapter_to_pwrctl (padapter);
  struct wowlan_ioctl_param poidparam;
  u8 ps_mode;
  int ret = _SUCCESS;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  
