jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  pwrpriv->wowlan_ap_mode = _TRUE;
  
  DBG_871X ("wowlan_ap_mode: %d\n", pwrpriv->wowlan_ap_mode);
  
  if (pnetdev)
  { rtw_netif_stop_queue (pnetdev); }
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
    if (pbuddy_netdev)
    { rtw_netif_stop_queue (pbuddy_netdev); }
  }
  #endif//CONFIG_CONCURRENT_MODE
  padapter->bDriverStopped = _TRUE;
  rtw_stop_drv_threads (padapter);
  padapter->bDriverStopped = _FALSE; 
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    padapter->pbuddy_adapter->bDriverStopped = _TRUE;
    rtw_stop_drv_threads (padapter->pbuddy_adapter);
    padapter->pbuddy_adapter->bDriverStopped = _FALSE; 
  }
  #endif
  
  
  rtw_hal_disable_interrupt (padapter);
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    padapter->pbuddy_adapter->intf_stop (padapter->pbuddy_adapter);
  }
  #endif
  
  if (padapter->HalFunc.clear_interrupt)
  { padapter->HalFunc.clear_interrupt (padapter); }
  
  if (padapter->intf_free_irq)
  { padapter->intf_free_irq (adapter_to_dvobj (padapter) ); }
  
  #ifdef CONFIG_RUNTIME_PORT_SWITCH
  if (rtw_port_switch_chk (padapter) ) {
    DBG_871X (" ### PORT SWITCH ### \n");
    rtw_hal_set_hwreg (padapter, HW_VAR_PORT_SWITCH, NULL);
  }
  #endif
  
  poidparam.subcode = WOWLAN_AP_ENABLE;
  padapter->HalFunc.SetHwRegHandler (padapter,
                                     HW_VAR_AP_WOWLAN, (u8 *) &poidparam);
                                     
  DBG_871X_LEVEL (_drv_always_, "%s: wowmode suspending\n", __func__);
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (check_buddy_fwstate (padapter, WIFI_AP_STATE) == _TRUE) {
    if (rtw_get_ch_setting_union (padapter->pbuddy_adapter, &ch, &bw, &offset) != 0) {
      DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
                FUNC_ADPT_ARG (padapter->pbuddy_adapter), ch, bw, offset);
      set_channel_bwmode (padapter->pbuddy_adapter, ch, offset, bw);
    }
    rtw_suspend_free_assoc_resource (padapter);
  }
  else {
    if (rtw_get_ch_setting_union (padapter, &ch, &bw, &offset) != 0) {
      DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
                FUNC_ADPT_ARG (padapter), ch, bw, offset);
      set_channel_bwmode (padapter, ch, offset, bw);
    }
    rtw_suspend_free_assoc_resource (padapter->pbuddy_adapter);
  }
  #else
  if (rtw_get_ch_setting_union (padapter, &ch, &bw, &offset) != 0) {
    DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
              FUNC_ADPT_ARG (padapter), ch, bw, offset);
    set_channel_bwmode (padapter, ch, offset, bw);
  }
  #endif
  
  #ifdef CONFIG_POWER_SAVING
  #ifdef CONFIG_LPS
  rtw_set_ps_mode (padapter, PS_MODE_MIN, 0, 0, "AP-WOWLAN");
  #endif
  #endif
  
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  return ret;
}
#endif


int rtw_suspend_normal (_adapter * padapter)
{
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct net_device * pnetdev = padapter->pnetdev;
  #ifdef CONFIG_CONCURRENT_MODE
  struct net_device * pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
  #endif
  struct pwrctrl_priv * pwrpriv = adapter_to_pwrctl (padapter);
  int ret = _SUCCESS;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  if (pnetdev) {
    netif_carrier_off (pnetdev);
    rtw_netif_stop_queue (pnetdev);
  }
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
    netif_carrier_off (pbuddy_netdev);
    rtw_netif_stop_queue (pbuddy_netdev);
  }
  #endif
  
  rtw_suspend_free_assoc_resource (padapter);
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    rtw_suspend_free_assoc_resource (padapter->pbuddy_adapter);
  }
  #endif
  rtw_led_control (padapter, LED_CTL_POWER_OFF);
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    rtw_dev_unload (padapter->pbuddy_adapter);
  }
  #endif
  rtw_dev_unload (padapter);
  
  if (padapter->intf_deinit)
  { padapter->intf_deinit (adapter_to_dvobj (padapter) ); }
  
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  return ret;
}

int rtw_suspend_common (_adapter * padapter)
{
  struct dvobj_priv * psdpriv = padapter->dvobj;
  struct debug_priv * pdbgpriv = &psdpriv->drv_dbg;
  struct pwrctrl_priv * pwrpriv = dvobj_to_pwrctl (psdpriv);
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  
  int ret = 0;
  u32 start_time = rtw_get_current_time();
  
  DBG_871X_LEVEL (_drv_always_, " suspend start\n");
  DBG_871X ("==> %s (%s:%d)\n", __FUNCTION__, current->comm, current->pid);
  pdbgpriv->dbg_suspend_cnt++;
  
  pwrpriv->bInSuspend = _TRUE;
  
  while (pwrpriv->bips_processing == _TRUE)
  { rtw_msleep_os (1); }
  
  #ifdef CONFIG_IOL_READ_EFUSE_MAP
  if (!padapter->bup) {
    u8 bMacPwrCtrlOn = _FALSE;
    rtw_hal_get_hwreg (padapter, HW_VAR_APFM_ON_MAC, &bMacPwrCtrlOn);
    if (bMacPwrCtrlOn)
    { rtw_hal_power_off (padapter); }
  }
  #endif
  
  if ( (!padapter->bup) || (padapter->bDriverStopped) || (padapter->bSurpriseRemoved) )
  {
    DBG_871X ("%s bup=%d bDriverStopped=%d bSurpriseRemoved = %d\n", __FUNCTION__
              , padapter->bup, padapter->bDriverStopped, padapter->bSurpriseRemoved);
    pdbgpriv->dbg_suspend_error_cnt++;
    goto exit;
  }
  rtw_ps_deny (padapter, PS_DENY_SUSPEND);
  
  rtw_cancel_all_timer (padapter);
  #ifdef CONFIG_CONCURRENT_MODE
  if (padapter->pbuddy_adapter) {
    rtw_cancel_all_timer (padapter->pbuddy_adapter);
  }
  #endif
  
  LeaveAllPowerSaveModeDirect (padapter);
  
  rtw_stop_cmd_thread (padapter);
  
  #ifdef CONFIG_BT_COEXIST
  if (check_fwstate (pmlmepriv, WIFI_AP_STATE) == _TRUE) {
    rtw_btcoex_SuspendNotify (padapter, 0);
    DBG_871X ("WIFI_AP_STATE\n");
    #ifdef CONFIG_CONCURRENT_MODE
  }
  else
    if (check_buddy_fwstate (padapter, WIFI_AP_STATE) ) {
      rtw_btcoex_SuspendNotify (padapter, 0);
      DBG_871X ("P2P_ROLE_GO\n");
    #endif
    }
    else
      if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) == _TRUE) {
        rtw_btcoex_SuspendNotify (padapter, 1);
        DBG_871X ("STATION\n");
      }
  #endif
      
  rtw_ps_deny_cancel (padapter, PS_DENY_SUSPEND);
  
  if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) == _TRUE
    #ifdef CONFIG_CONCURRENT_MODE
      && check_buddy_fwstate (padapter, WIFI_AP_STATE) == _FALSE
    #endif
     ) {
    #ifdef CONFIG_WOWLAN
    rtw_suspend_wow (padapter);
    #else
    rtw_suspend_normal (padapter);
    #endif
  }
  else
    if (check_fwstate (pmlmepriv, WIFI_AP_STATE) == _TRUE
      #ifdef CONFIG_CONCURRENT_MODE
        && check_buddy_fwstate (padapter, WIFI_AP_STATE) == _FALSE
      #endif
       ) {
      #ifdef CONFIG_AP_WOWLAN
      rtw_suspend_ap_wow (padapter);
      #else
      rtw_suspend_normal (padapter);
      #endif
      #ifdef CONFIG_CONCURRENT_MODE
    }
    else
      if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) == _TRUE
          && check_buddy_fwstate (padapter, WIFI_AP_STATE) == _TRUE) {
        #ifdef CONFIG_AP_WOWLAN
        rtw_suspend_ap_wow (padapter);
        #else
        rtw_suspend_normal (padapter);
        #endif
      #endif
      }
      else {
        rtw_suspend_normal (padapter);
      }
      
  DBG_871X_LEVEL (_drv_always_, "rtw suspend success in %d ms\n",
                  rtw_get_passing_time_ms (start_time) );
                  
