jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
exit:
  DBG_871X ("<===  %s return %d.............. in %dms\n", __FUNCTION__
            , ret, rtw_get_passing_time_ms (start_time) );
            
  return ret;
}

#ifdef CONFIG_WOWLAN
int rtw_resume_process_wow (_adapter * padapter)
{
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct net_device * pnetdev = padapter->pnetdev;
  #ifdef CONFIG_CONCURRENT_MODE
  struct net_device * pbuddy_netdev;
  #endif
  struct pwrctrl_priv * pwrpriv = adapter_to_pwrctl (padapter);
  struct dvobj_priv * psdpriv = padapter->dvobj;
  struct debug_priv * pdbgpriv = &psdpriv->drv_dbg;
  struct wowlan_ioctl_param poidparam;
  struct sta_info * psta = NULL;
  int ret = _SUCCESS;
  _func_enter_;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  
  if (padapter) {
    pnetdev = padapter->pnetdev;
    pwrpriv = adapter_to_pwrctl (padapter);
  }
  else {
    pdbgpriv->dbg_resume_error_cnt++;
    ret = -1;
    goto exit;
  }
  
  #ifdef CONFIG_PNO_SUPPORT
  pwrpriv->pno_in_resume = _TRUE;
  #endif
  
  if (pwrpriv->wowlan_mode == _TRUE) {
    #ifdef CONFIG_POWER_SAVING
    #ifdef CONFIG_LPS
    rtw_set_ps_mode (padapter, PS_MODE_ACTIVE, 0, 0, "WOWLAN");
    #endif
    #endif
    pwrpriv->bFwCurrentInPSMode = _FALSE;
    
    #ifdef CONFIG_SDIO_HCI
    if (padapter->intf_stop) {
      padapter->intf_stop (padapter);
    }
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      padapter->pbuddy_adapter->intf_stop (padapter->pbuddy_adapter);
    }
    #endif
    
    if (padapter->HalFunc.clear_interrupt)
    { padapter->HalFunc.clear_interrupt (padapter); }
    #endif
    
    if ( (padapter->intf_alloc_irq) && (padapter->intf_alloc_irq (adapter_to_dvobj (padapter) ) != _SUCCESS) ) {
      ret = -1;
      RT_TRACE (_module_hci_intfs_c_, _drv_err_, ("%s: sdio_alloc_irq Failed!!\n", __FUNCTION__) );
      goto exit;
    }
    
    poidparam.subcode = WOWLAN_DISABLE;
    padapter->HalFunc.SetHwRegHandler (padapter, HW_VAR_WOWLAN, (u8 *) &poidparam);
    
    #ifdef CONFIG_CONCURRENT_MODE
    rtw_reset_drv_sw (padapter->pbuddy_adapter);
    #endif
    
    psta = rtw_get_stainfo (&padapter->stapriv, get_bssid (&padapter->mlmepriv) );
    if (psta) {
      set_sta_rate (padapter, psta);
    }
    
    
    padapter->bDriverStopped = _FALSE;
    DBG_871X ("%s: wowmode resuming, DriverStopped:%d\n", __func__, padapter->bDriverStopped);
    rtw_start_drv_threads (padapter);
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (padapter->pbuddy_adapter)
    {
      padapter->pbuddy_adapter->bDriverStopped = _FALSE;
      DBG_871X ("%s: wowmode resuming, pbuddy_adapter->DriverStopped:%d\n",
                __FUNCTION__, padapter->pbuddy_adapter->bDriverStopped);
      rtw_start_drv_threads (padapter->pbuddy_adapter);
    }
    #endif
    
    if (padapter->intf_start) {
      padapter->intf_start (padapter);
    }
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      padapter->pbuddy_adapter->intf_start (padapter->pbuddy_adapter);
    }
    
    if (rtw_buddy_adapter_up (padapter) ) {
      pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
      
      if (pbuddy_netdev) {
        netif_device_attach (pbuddy_netdev);
        netif_carrier_on (pbuddy_netdev);
      }
    }
    #endif
    
    if (pnetdev) {
      if (!rtw_netif_queue_stopped (pnetdev) )
      { rtw_netif_start_queue (pnetdev); }
      else
      { rtw_netif_wake_queue (pnetdev); }
    }
  }
  else {
  
    if ( (padapter->intf_init) && (padapter->intf_init (adapter_to_dvobj (padapter) ) != _SUCCESS) )
    {
      ret = -1;
      RT_TRACE (_module_hci_intfs_c_, _drv_err_, ("%s: initialize SDIO Failed!!\n", __FUNCTION__) );
      goto exit;
    }
    
    rtw_hal_disable_interrupt (padapter);
    
    if (padapter->HalFunc.clear_interrupt)
    { padapter->HalFunc.clear_interrupt (padapter); }
    
    if ( (padapter->intf_alloc_irq) && (padapter->intf_alloc_irq (adapter_to_dvobj (padapter) ) != _SUCCESS) )
    {
      ret = -1;
      RT_TRACE (_module_hci_intfs_c_, _drv_err_, ("%s: sdio_alloc_irq Failed!!\n", __FUNCTION__) );
      goto exit;
    }
    
    rtw_reset_drv_sw (padapter);
    #ifdef CONFIG_CONCURRENT_MODE
    rtw_reset_drv_sw (padapter->pbuddy_adapter);
    #endif
    pwrpriv->bkeepfwalive = _FALSE;
    
    DBG_871X ("bkeepfwalive(%x)\n", pwrpriv->bkeepfwalive);
    
    if (pm_netdev_close (pnetdev, _TRUE) == 0) {
      DBG_871X ("netdev_close success\n");
    }
    
    if (pm_netdev_open (pnetdev, _TRUE) != 0) {
      ret = -1;
      pdbgpriv->dbg_resume_error_cnt++;
      goto exit;
    }
    
    netif_device_attach (pnetdev);
    netif_carrier_on (pnetdev);
    
    #ifdef CONFIG_CONCURRENT_MODE
    if (rtw_buddy_adapter_up (padapter) ) {
      pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
      netif_device_attach (pbuddy_netdev);
      netif_carrier_on (pbuddy_netdev);
    }
    #endif
  }
  
  if ( padapter->pid[1] != 0) {
    DBG_871X ("pid[1]:%d\n", padapter->pid[1]);
    rtw_signal_process (padapter->pid[1], SIGUSR2);
  }
  
  if (rtw_chk_roam_flags (padapter, RTW_ROAM_ON_RESUME) ) {
    if (pwrpriv->wowlan_wake_reason == FWDecisionDisconnect ||
        pwrpriv->wowlan_wake_reason == Rx_DisAssoc ||
        pwrpriv->wowlan_wake_reason == Rx_DeAuth) {
        
      DBG_871X ("%s: disconnect reason: %02x\n", __func__,
                pwrpriv->wowlan_wake_reason);
      rtw_indicate_disconnect (padapter);
      rtw_sta_media_status_rpt (padapter, rtw_get_stainfo (&padapter->stapriv, get_bssid (&padapter->mlmepriv) ), 0);
      rtw_free_assoc_resources (padapter, 1);
    }
    else {
      DBG_871X ("%s: do roaming\n", __func__);
      rtw_roaming (padapter, NULL);
    }
  }
  
  #ifdef CONFIG_RESUME_IN_WORKQUEUE
  rtw_unlock_suspend();
  #endif
  
  
  if (pwrpriv->wowlan_wake_reason == Rx_GTK ||
      pwrpriv->wowlan_wake_reason == Rx_DisAssoc ||
      pwrpriv->wowlan_wake_reason == Rx_DeAuth ||
      pwrpriv->wowlan_wake_reason == RX_PNOWakeUp) {
    rtw_lock_ext_suspend_timeout (8000);
  }
  
