jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
  if (pwrpriv->wowlan_mode == _TRUE) {
    pwrpriv->bips_processing = _FALSE;
    _set_timer (&padapter->mlmepriv.dynamic_chk_timer, 2000);
    #ifndef CONFIG_IPS_CHECK_IN_WD
    rtw_set_pwr_state_check_timer (pwrpriv);
    #endif
  }
  else {
    DBG_871X_LEVEL (_drv_always_, "do not reset timer\n");
  }
  
  pwrpriv->wowlan_mode = _FALSE;
  
  pwrpriv->wowlan_wake_reason = 0;
exit:
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  _func_exit_;
  return ret;
}
#endif

#ifdef CONFIG_AP_WOWLAN
int rtw_resume_process_ap_wow (_adapter * padapter)
{
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  struct net_device * pnetdev = padapter->pnetdev;
  #ifdef CONFIG_CONCURRENT_MODE
  struct net_device * pbuddy_netdev;
  #endif
  struct pwrctrl_priv * pwrpriv = adapter_to_pwrctl (padapter);
  struct dvobj_priv * psdpriv = padapter->dvobj;
  struct debug_priv * pdbgpriv = &psdpriv->drv_dbg;
  struct wowlan_ioctl_param poidparam;
  struct sta_info * psta = NULL;
  int ret = _SUCCESS;
  u8 ch, bw, offset;
  _func_enter_;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  
  if (padapter) {
    pnetdev = padapter->pnetdev;
    pwrpriv = adapter_to_pwrctl (padapter);
  }
  else {
    pdbgpriv->dbg_resume_error_cnt++;
    ret = -1;
    goto exit;
  }
  
  #ifdef CONFIG_POWER_SAVING
  #ifdef CONFIG_LPS
  rtw_set_ps_mode (padapter, PS_MODE_ACTIVE, 0, 0, "AP-WOWLAN");
  #endif
  #endif
  pwrpriv->bFwCurrentInPSMode = _FALSE;
  
  rtw_hal_disable_interrupt (padapter);
  
  if (padapter->HalFunc.clear_interrupt)
  { padapter->HalFunc.clear_interrupt (padapter); }
  
  if ( (padapter->intf_alloc_irq) && (padapter->intf_alloc_irq (adapter_to_dvobj (padapter) ) != _SUCCESS) ) {
    ret = -1;
    RT_TRACE (_module_hci_intfs_c_, _drv_err_, ("%s: sdio_alloc_irq Failed!!\n", __FUNCTION__) );
    goto exit;
  }
  
  poidparam.subcode = WOWLAN_AP_DISABLE;
  padapter->HalFunc.SetHwRegHandler (padapter,
                                     HW_VAR_AP_WOWLAN, (u8 *) &poidparam);
  pwrpriv->wowlan_ap_mode = _FALSE;
  
  padapter->bDriverStopped = _FALSE;
  DBG_871X ("%s: wowmode resuming, DriverStopped:%d\n", __func__, padapter->bDriverStopped);
  rtw_start_drv_threads (padapter);
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) )
  {
    padapter->pbuddy_adapter->bDriverStopped = _FALSE;
    DBG_871X ("%s: wowmode resuming, pbuddy_adapter->DriverStopped:%d\n",
              __FUNCTION__, padapter->pbuddy_adapter->bDriverStopped);
    rtw_start_drv_threads (padapter->pbuddy_adapter);
  }
  #endif
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    if (rtw_get_ch_setting_union (padapter->pbuddy_adapter, &ch, &bw, &offset) != 0) {
      DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
                FUNC_ADPT_ARG (padapter->pbuddy_adapter), ch, bw, offset);
      set_channel_bwmode (padapter->pbuddy_adapter, ch, offset, bw);
    }
  }
  else {
    DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
              FUNC_ADPT_ARG (padapter), ch, bw, offset);
    set_channel_bwmode (padapter, ch, offset, bw);
    rtw_reset_drv_sw (padapter->pbuddy_adapter);
  }
  #else
  if (rtw_get_ch_setting_union (padapter, &ch, &bw, &offset) != 0) {
    DBG_871X (FUNC_ADPT_FMT" back to linked/linking union - ch:%u, bw:%u, offset:%u\n",
              FUNC_ADPT_ARG (padapter), ch, bw, offset);
    set_channel_bwmode (padapter, ch, offset, bw);
  }
  #endif
  
  if (padapter->intf_start) {
    padapter->intf_start (padapter);
  }
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    padapter->pbuddy_adapter->intf_start (padapter->pbuddy_adapter);
  }
  #endif
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
    if (pbuddy_netdev) {
      if (!rtw_netif_queue_stopped (pbuddy_netdev) )
      { rtw_netif_start_queue (pbuddy_netdev); }
      else
      { rtw_netif_wake_queue (pbuddy_netdev); }
    }
  }
  #endif
  
  if (pnetdev) {
    if (!rtw_netif_queue_stopped (pnetdev) )
    { rtw_netif_start_queue (pnetdev); }
    else
    { rtw_netif_wake_queue (pnetdev); }
  }
  
  if ( padapter->pid[1] != 0) {
    DBG_871X ("pid[1]:%d\n", padapter->pid[1]);
    rtw_signal_process (padapter->pid[1], SIGUSR2);
  }
  
  #ifdef CONFIG_RESUME_IN_WORKQUEUE
  rtw_unlock_suspend();
  #endif
  
  if (pwrpriv->wowlan_wake_reason == AP_WakeUp)
  { rtw_lock_ext_suspend_timeout (8000); }
  
  pwrpriv->bips_processing = _FALSE;
  _set_timer (&padapter->mlmepriv.dynamic_chk_timer, 2000);
  #ifndef CONFIG_IPS_CHECK_IN_WD
  rtw_set_pwr_state_check_timer (pwrpriv);
  #endif
  pwrpriv->wowlan_wake_reason = 0;
exit:
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  _func_exit_;
  return ret;
}
#endif

int rtw_resume_process_normal (_adapter * padapter)
{
  struct net_device * pnetdev;
  #ifdef CONFIG_CONCURRENT_MODE
  struct net_device * pbuddy_netdev;
  #endif
  struct pwrctrl_priv * pwrpriv;
  struct mlme_priv * pmlmepriv;
  struct dvobj_priv * psdpriv;
  struct debug_priv * pdbgpriv;
  
  int ret = _SUCCESS;
  _func_enter_;
  
  if (!padapter) {
    ret = -1;
    goto exit;
  }
  
  pnetdev = padapter->pnetdev;
  pwrpriv = adapter_to_pwrctl (padapter);
  pmlmepriv = &padapter->mlmepriv;
  psdpriv = padapter->dvobj;
  pdbgpriv = &psdpriv->drv_dbg;
  
  DBG_871X ("==> "FUNC_ADPT_FMT" entry....\n", FUNC_ADPT_ARG (padapter) );
  if ( (padapter->intf_init) && (padapter->intf_init (adapter_to_dvobj (padapter) ) != _SUCCESS) )
  {
    ret = -1;
    RT_TRACE (_module_hci_intfs_c_, _drv_err_, ("%s: initialize SDIO Failed!!\n", __FUNCTION__) );
    goto exit;
  }
  rtw_hal_disable_interrupt (padapter);
  if ( (padapter->intf_alloc_irq) && (padapter->intf_alloc_irq (adapter_to_dvobj (padapter) ) != _SUCCESS) )
  {
    ret = -1;
    RT_TRACE (_module_hci_intfs_c_, _drv_err_, ("%s: sdio_alloc_irq Failed!!\n", __FUNCTION__) );
    goto exit;
  }
  
  rtw_reset_drv_sw (padapter);
  #ifdef CONFIG_CONCURRENT_MODE
  rtw_reset_drv_sw (padapter->pbuddy_adapter);
  #endif
  
  pwrpriv->bkeepfwalive = _FALSE;
  
  DBG_871X ("bkeepfwalive(%x)\n", pwrpriv->bkeepfwalive);
  if (pm_netdev_open (pnetdev, _TRUE) != 0) {
    ret = -1;
    pdbgpriv->dbg_resume_error_cnt++;
    goto exit;
  }
  
  netif_device_attach (pnetdev);
  netif_carrier_on (pnetdev);
  
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) ) {
    pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
    
    netif_device_attach (pbuddy_netdev);
    netif_carrier_on (pbuddy_netdev);
  }
  #endif
  
  
  if ( padapter->pid[1] != 0) {
    DBG_871X ("pid[1]:%d\n", padapter->pid[1]);
    rtw_signal_process (padapter->pid[1], SIGUSR2);
  }
  
  
  if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) ) {
    DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - WIFI_STATION_STATE\n", FUNC_ADPT_ARG (padapter), get_fwstate (pmlmepriv) );
    
