jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/os_intfs.c
    if (rtw_chk_roam_flags (padapter, RTW_ROAM_ON_RESUME) )
    { rtw_roaming (padapter, NULL); }
    
  }
  else
    if (check_fwstate (pmlmepriv, WIFI_AP_STATE) ) {
      DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - WIFI_AP_STATE\n", FUNC_ADPT_ARG (padapter), get_fwstate (pmlmepriv) );
      rtw_ap_restore_network (padapter);
    }
    else
      if (check_fwstate (pmlmepriv, WIFI_ADHOC_STATE) ) {
        DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - WIFI_ADHOC_STATE\n", FUNC_ADPT_ARG (padapter), get_fwstate (pmlmepriv) );
      }
      else {
        DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - ???\n", FUNC_ADPT_ARG (padapter), get_fwstate (pmlmepriv) );
      }
      
  #ifdef CONFIG_CONCURRENT_MODE
  if (rtw_buddy_adapter_up (padapter) )
  {
    _adapter * buddy = padapter->pbuddy_adapter;
    struct mlme_priv * buddy_mlme = &padapter->pbuddy_adapter->mlmepriv;
    if (check_fwstate (buddy_mlme, WIFI_STATION_STATE) ) {
      DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - WIFI_STATION_STATE\n", FUNC_ADPT_ARG (buddy), get_fwstate (buddy_mlme) );
      
      if (rtw_chk_roam_flags (buddy, RTW_ROAM_ON_RESUME) )
      { rtw_roaming (buddy, NULL); }
      
    }
    else
      if (check_fwstate (buddy_mlme, WIFI_AP_STATE) ) {
        DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - WIFI_AP_STATE\n", FUNC_ADPT_ARG (buddy), get_fwstate (buddy_mlme) );
        rtw_ap_restore_network (buddy);
      }
      else
        if (check_fwstate (buddy_mlme, WIFI_ADHOC_STATE) ) {
          DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - WIFI_ADHOC_STATE\n", FUNC_ADPT_ARG (buddy), get_fwstate (buddy_mlme) );
        }
        else {
          DBG_871X (FUNC_ADPT_FMT" fwstate:0x%08x - ???\n", FUNC_ADPT_ARG (buddy), get_fwstate (buddy_mlme) );
        }
  }
  #endif
  
  #ifdef CONFIG_RESUME_IN_WORKQUEUE
  rtw_unlock_suspend();
  #endif
  DBG_871X ("<== "FUNC_ADPT_FMT" exit....\n", FUNC_ADPT_ARG (padapter) );
  
exit:
  _func_exit_;
  return ret;
}

int rtw_resume_common (_adapter * padapter)
{
  int ret = 0;
  u32 start_time = rtw_get_current_time();
  struct pwrctrl_priv * pwrpriv = adapter_to_pwrctl (padapter);
  struct mlme_priv * pmlmepriv = &padapter->mlmepriv;
  
  _func_enter_;
  
  DBG_871X_LEVEL (_drv_always_, "resume start\n");
  DBG_871X ("==> %s (%s:%d)\n", __FUNCTION__, current->comm, current->pid);
  
  if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) == _TRUE
    #ifdef CONFIG_CONCURRENT_MODE
      && check_buddy_fwstate (padapter, WIFI_AP_STATE) == _FALSE
    #endif
     ) {
    #ifdef CONFIG_WOWLAN
    rtw_resume_process_wow (padapter);
    #else
    rtw_resume_process_normal (padapter);
    #endif
    
  }
  else
    if (check_fwstate (pmlmepriv, WIFI_AP_STATE) == _TRUE
      #ifdef CONFIG_CONCURRENT_MODE
        && check_buddy_fwstate (padapter, WIFI_AP_STATE) == _FALSE
      #endif
       ) {
      #ifdef CONFIG_AP_WOWLAN
      rtw_resume_process_ap_wow (padapter);
      #else
      rtw_resume_process_normal (padapter);
      #endif
      #ifdef CONFIG_CONCURRENT_MODE
    }
    else
      if (check_fwstate (pmlmepriv, WIFI_STATION_STATE) == _TRUE
          && check_buddy_fwstate (padapter, WIFI_AP_STATE) == _TRUE) {
        #ifdef CONFIG_AP_WOWLAN
        rtw_resume_process_ap_wow (padapter);
        #else
        rtw_resume_process_normal (padapter);
        #endif
      #endif
      }
      else {
        rtw_resume_process_normal (padapter);
      }
      
  #ifdef CONFIG_BT_COEXIST
  rtw_btcoex_SuspendNotify (padapter, 0);
  #endif
  
  if (pwrpriv) {
    pwrpriv->bInSuspend = _FALSE;
    #ifdef CONFIG_PNO_SUPPORT
    pwrpriv->pno_in_resume = _FALSE;
    #endif
  }
  DBG_871X_LEVEL (_drv_always_, "%s:%d in %d ms\n", __FUNCTION__ , ret,
                  rtw_get_passing_time_ms (start_time) );
                  
  _func_exit_;
  
  return ret;
}
#endif


